const THAI_DATA = [
  {
    "id": 1,
    "char": "ก",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ก ไก่",
      "roman": "kɔɔ kài",
      "tts": "กอ ไก่"
    },
    "sound": {
      "init": "k",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "กะ": "ka",
      "กา": "kaa",
      "กิ": "ki",
      "กี": "kii",
      "กึ": "kue",
      "กื": "kuue",
      "กุ": "ku",
      "กู": "kuu",
      "เกะ": "ke",
      "เก": "kee",
      "แกะ": "kae",
      "แก": "kaae",
      "โกะ": "ko",
      "โก": "koo",
      "เกอะ": "koe",
      "เกอ": "kooe"
    },
    "spell": {
      "กอ อะ": "กะ",
      "กอ อา": "กา",
      "กอ อิ": "กิ",
      "กอ อี": "กี",
      "กอ อึ": "กึ",
      "กอ อื": "กื",
      "กอ อุ": "กุ",
      "กอ อู": "กู",
      "กอ เอะ": "เกะ",
      "กอ เอ": "เก",
      "กอ แอะ": "แกะ",
      "กอ แอ": "แก",
      "กอ โอะ": "โกะ",
      "กอ โอ": "โก",
      "กอ เออะ": "เกอะ",
      "กอ เออ": "เกอ"
    },
    "vocab": {
      "word": "ไก่",
      "roman": "kài",
      "mean": "鶏"
    },
    "tip": "くちばしがある"
  },
  {
    "id": 2,
    "char": "ข",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ข ไข่",
      "roman": "khɔ̌ɔ khài",
      "tts": "ขอ ไข่"
    },
    "sound": {
      "init": "kh",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ขะ": "kha",
      "ขา": "khaa",
      "ขิ": "khi",
      "ขี": "khii",
      "ขึ": "khue",
      "ขื": "khuue",
      "ขุ": "khu",
      "ขู": "khuu",
      "เขะ": "khe",
      "เข": "khee",
      "แขะ": "khae",
      "แข": "khaae",
      "โขะ": "kho",
      "โข": "khoo",
      "เขอะ": "khoe",
      "เขอ": "khooe"
    },
    "spell": {
      "ขอ อะ": "ขะ",
      "ขอ อา": "ขา",
      "ขอ อิ": "ขิ",
      "ขอ อี": "ขี",
      "ขอ อึ": "ขึ",
      "ขอ อื": "ขื",
      "ขอ อุ": "ขุ",
      "ขอ อู": "ขู",
      "ขอ เอะ": "เขะ",
      "ขอ เอ": "เข",
      "ขอ แอะ": "แขะ",
      "ขอ แอ": "แข",
      "ขอ โอะ": "โขะ",
      "ขอ โอ": "โข",
      "ขอ เออะ": "เขอะ",
      "ขอ เออ": "เขอ"
    },
    "vocab": {
      "word": "ไข่",
      "roman": "khài",
      "mean": "卵"
    },
    "tip": "幅が狭い・頭が丸い"
  },
  {
    "id": 3,
    "char": "ฃ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ฃ ขวด",
      "roman": "khɔ̌ɔ khùat",
      "tts": "ขอ ขวด"
    },
    "sound": {
      "init": "kh",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "คะ": "kha",
      "คา": "khaa",
      "คิ": "khi",
      "คี": "khii",
      "คึ": "khue",
      "คื": "khuue",
      "คุ": "khu",
      "คู": "khuu",
      "เคะ": "khe",
      "เค": "khee",
      "แคะ": "khae",
      "แค": "khaae",
      "โคะ": "kho",
      "โค": "khoo",
      "เคอะ": "khoe",
      "เคอ": "khooe"
    },
    "spell": {
      "คอ อะ": "คะ",
      "คอ อา": "คา",
      "คอ อิ": "คิ",
      "คอ อี": "คี",
      "คอ อึ": "คึ",
      "คอ อื": "คื",
      "คอ อุ": "คุ",
      "คอ อู": "คู",
      "คอ เอะ": "เคะ",
      "คอ เอ": "เค",
      "คอ แอะ": "แคะ",
      "คอ แอ": "แค",
      "คอ โอะ": "โคะ",
      "คอ โอ": "โค",
      "คอ เออะ": "เคอะ",
      "คอ เออ": "เคอ"
    },
    "vocab": {
      "word": "-",
      "roman": "-",
      "mean": "(廃字)"
    },
    "tip": "ขの頭が割れた形"
  },
  {
    "id": 4,
    "char": "ค",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ค ควาย",
      "roman": "khɔɔ khwaai",
      "tts": "คอ ควาย"
    },
    "sound": {
      "init": "kh",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฆะ": "kha",
      "ฆา": "khaa",
      "ฆิ": "khi",
      "ฆี": "khii",
      "ฆึ": "khue",
      "ฆื": "khuue",
      "ฆุ": "khu",
      "ฆู": "khuu",
      "เฆะ": "khe",
      "เฆ": "khee",
      "แฆะ": "khae",
      "แฆ": "khaae",
      "โฆะ": "kho",
      "โฆ": "khoo"
    },
    "spell": {
      "ฆอ อะ": "ฆะ",
      "ฆอ อา": "ฆา",
      "ฆอ อิ": "ฆิ",
      "ฆอ อี": "ฆี",
      "ฆอ อึ": "ฆึ",
      "ฆอ อื": "ฆื",
      "ฆอ อุ": "ฆุ",
      "ฆอ อู": "ฆู",
      "ฆอ เอะ": "เฆะ",
      "ฆอ เอ": "เฆ",
      "ฆอ แอะ": "แฆะ",
      "ฆอ แอ": "แฆ",
      "ฆอ โอะ": "โฆะ",
      "ฆอ โอ": "โฆ"
    },
    "vocab": {
      "word": "ควาย",
      "roman": "khwaai",
      "mean": "水牛"
    },
    "tip": "ดの頭が外向き"
  },
  {
    "id": 5,
    "char": "ฅ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฅ คน",
      "roman": "khɔɔ khon",
      "tts": "คอ คน"
    },
    "sound": {
      "init": "kh",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "งะ": "nga",
      "งา": "ngaa",
      "งิ": "ngi",
      "งี": "ngii",
      "งึ": "ngue",
      "งื": "nguue",
      "งุ": "ngu",
      "งู": "nguu",
      "เงะ": "nge",
      "เง": "ngee",
      "แงะ": "ngae",
      "แง": "ngaae",
      "โงะ": "ngo",
      "โง": "ngoo"
    },
    "spell": {
      "งอ อะ": "งะ",
      "งอ อา": "งา",
      "งอ อิ": "งิ",
      "งอ อี": "งี",
      "งอ อึ": "งึ",
      "งอ อื": "งื",
      "งอ อุ": "งุ",
      "งอ อู": "งู",
      "งอ เอะ": "เงะ",
      "งอ เอ": "เง",
      "งอ แอะ": "แงะ",
      "งอ แอ": "แง",
      "งอ โอะ": "โงะ",
      "งอ โอ": "โง"
    },
    "vocab": {
      "word": "-",
      "roman": "-",
      "mean": "(廃字)"
    },
    "tip": "คの頭が割れた形"
  },
  {
    "id": 6,
    "char": "ฆ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฆ ระฆัง",
      "roman": "khɔɔ rá-khaŋ",
      "tts": "คอ ระฆัง"
    },
    "sound": {
      "init": "kh",
      "final": "k"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "จะ": "ca",
      "จา": "caa",
      "จิ": "ci",
      "จี": "cii",
      "จึ": "cue",
      "จื": "cuue",
      "จุ": "cu",
      "จู": "cuu",
      "เจะ": "ce",
      "เจ": "cee",
      "แจะ": "cae",
      "แจ": "caae",
      "โจะ": "co",
      "โจ": "coo"
    },
    "spell": {
      "จอ อะ": "จะ",
      "จอ อา": "จา",
      "จอ อิ": "จิ",
      "จอ อี": "จี",
      "จอ อึ": "จึ",
      "จอ อื": "จื",
      "จอ อุ": "จุ",
      "จอ อู": "จู",
      "จอ เอะ": "เจะ",
      "จอ เอ": "เจ",
      "จอ แอะ": "แจะ",
      "จอ แอ": "แจ",
      "จอ โอะ": "โจะ",
      "จอ โอ": "โจ"
    },
    "vocab": {
      "word": "ระฆัง",
      "roman": "rá-khaŋ",
      "mean": "お寺の鐘"
    },
    "tip": "มの頭が割れてる"
  },
  {
    "id": 7,
    "char": "ง",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ง งู",
      "roman": "ŋɔɔ ŋuu",
      "tts": "งอ งู"
    },
    "sound": {
      "init": "ŋ",
      "final": "ŋ"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฉะ": "cha",
      "ฉา": "chaa",
      "ฉิ": "chi",
      "ฉี": "chii",
      "ฉึ": "chue",
      "ฉื": "chuue",
      "ฉุ": "chu",
      "ฉู": "chuu",
      "เฉะ": "che",
      "เฉ": "chee",
      "แฉะ": "chae",
      "แฉ": "chaae",
      "โฉะ": "cho",
      "โฉ": "choo"
    },
    "spell": {
      "ฉอ อะ": "ฉะ",
      "ฉอ อา": "ฉา",
      "ฉอ อิ": "ฉิ",
      "ฉอ อี": "ฉี",
      "ฉอ อึ": "ฉึ",
      "ฉอ อื": "ฉื",
      "ฉอ อุ": "ฉุ",
      "ฉอ อู": "ฉู",
      "ฉอ เอะ": "เฉะ",
      "ฉอ เอ": "เฉ",
      "ฉอ แอะ": "แฉะ",
      "ฉอ แอ": "แฉ",
      "ฉอ โอะ": "โฉะ",
      "ฉอ โอ": "โฉ"
    },
    "vocab": {
      "word": "งู",
      "roman": "ŋuu",
      "mean": "蛇"
    },
    "tip": "尻尾が下へ曲がる"
  },
  {
    "id": 8,
    "char": "จ",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "จ จาน",
      "roman": "cɔɔ caan",
      "tts": "จอ จาน"
    },
    "sound": {
      "init": "c",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ชะ": "cha",
      "ชา": "chaa",
      "ชิ": "chi",
      "ชี": "chii",
      "ชึ": "chue",
      "ชื": "chuue",
      "ชุ": "chu",
      "ชู": "chuu",
      "เชะ": "che",
      "เช": "chee",
      "แชะ": "chae",
      "แช": "chaae",
      "โชะ": "cho",
      "โช": "choo"
    },
    "spell": {
      "ชอ อะ": "ชะ",
      "ชอ อา": "ชา",
      "ชอ อิ": "ชิ",
      "ชอ อี": "ชี",
      "ชอ อึ": "ชึ",
      "ชอ อื": "ชื",
      "ชอ อุ": "ชุ",
      "ชอ อู": "ชู",
      "ชอ เอะ": "เชะ",
      "ชอ เอ": "เช",
      "ชอ แอะ": "แชะ",
      "ชอ แอ": "แช",
      "ชอ โอะ": "โชะ",
      "ชอ โอ": "โช"
    },
    "vocab": {
      "word": "จาน",
      "roman": "caan",
      "mean": "皿"
    },
    "tip": "-"
  },
  {
    "id": 9,
    "char": "ฉ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ฉ ฉิ่ง",
      "roman": "chɔ̌ɔ chìŋ",
      "tts": "ฉอ ฉิ่ง"
    },
    "sound": {
      "init": "ch",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ซะ": "sa",
      "ซา": "saa",
      "ซิ": "si",
      "ซี": "sii",
      "ซึ": "sue",
      "ซื": "suue",
      "ซุ": "su",
      "ซู": "suu",
      "เซะ": "se",
      "เซ": "see",
      "แซะ": "sae",
      "แซ": "saae",
      "โซะ": "so",
      "โซ": "soo"
    },
    "spell": {
      "ซอ อะ": "ซะ",
      "ซอ อา": "ซา",
      "ซอ อิ": "ซิ",
      "ซอ อี": "ซี",
      "ซอ อึ": "ซึ",
      "ซอ อื": "ซื",
      "ซอ อุ": "ซุ",
      "ซอ อู": "ซู",
      "ซอ เอะ": "เซะ",
      "ซอ เอ": "เซ",
      "ซอ แอะ": "แซะ",
      "ซอ แอ": "แซ",
      "ซอ โอะ": "โซะ",
      "ซอ โอ": "โซ"
    },
    "vocab": {
      "word": "ฉิ่ง",
      "roman": "chìŋ",
      "mean": "シンバル"
    },
    "tip": "นの頭がない形"
  },
  {
    "id": 10,
    "char": "ช",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ช ช้าง",
      "roman": "chɔɔ cháaŋ",
      "tts": "ชอ ช้าง"
    },
    "sound": {
      "init": "ch",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ญะ": "ya",
      "ญา": "yaa",
      "ญิ": "yi",
      "ญี": "yii",
      "ญึ": "yue",
      "ญื": "yuue",
      "ญุ": "yu",
      "ญู": "yuu",
      "เญะ": "ye",
      "เญ": "yee",
      "โญะ": "yo",
      "โญ": "yoo"
    },
    "spell": {
      "ญอ อะ": "ญะ",
      "ญอ อา": "ญา",
      "ญอ อิ": "ญิ",
      "ญอ อี": "ญี",
      "ญอ อึ": "ญึ",
      "ญอ อื": "ญื",
      "ญอ อุ": "ญุ",
      "ญอ อู": "ญู",
      "ญอ เอะ": "เญะ",
      "ญอ เอ": "เญ",
      "ญอ แอะ": "แญะ",
      "ญอ แอ": "แญ",
      "ญอ โอะ": "โญะ",
      "ญอ โอ": "โญ"
    },
    "vocab": {
      "word": "ช้าง",
      "roman": "cháaŋ",
      "mean": "象"
    },
    "tip": "ขの尻尾が長い"
  },
  {
    "id": 11,
    "char": "ซ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ซ โซ่",
      "roman": "sɔɔ sôo",
      "tts": "ซอ โซ่"
    },
    "sound": {
      "init": "s",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ดะ": "da",
      "ดา": "daa",
      "ดิ": "di",
      "ดี": "dii",
      "ดึ": "due",
      "ดื": "duue",
      "ดุ": "du",
      "ดู": "duu",
      "เดะ": "de",
      "เด": "dee",
      "แดะ": "dae",
      "แด": "daae",
      "โดะ": "do",
      "โด": "doo",
      "เดอะ": "doe",
      "เดอ": "dooe"
    },
    "spell": {
      "ดอ อะ": "ดะ",
      "ดอ อา": "ดา",
      "ดอ อิ": "ดิ",
      "ดอ อี": "ดี",
      "ดอ อึ": "ดึ",
      "ดอ อื": "ดื",
      "ดอ อุ": "ดุ",
      "ดอ อู": "ดู",
      "ดอ เอะ": "เดะ",
      "ดอ เอ": "เด",
      "ดอ แอะ": "แดะ",
      "ดอ แอ": "แด",
      "ดอ โอะ": "โดะ",
      "ดอ โอ": "โด",
      "ดอ เออะ": "เดอะ",
      "ดอ เออ": "เดอ"
    },
    "vocab": {
      "word": "โซ่",
      "roman": "sôo",
      "mean": "鎖"
    },
    "tip": "ชの頭が割れた形"
  },
  {
    "id": 12,
    "char": "ฌ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฌ เฌอ",
      "roman": "chɔɔ chəə",
      "tts": "ชอ เฌอ"
    },
    "sound": {
      "init": "ch",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ตะ": "ta",
      "ตา": "taa",
      "ติ": "ti",
      "ตี": "tii",
      "ตึ": "tue",
      "ตื": "tuue",
      "ตุ": "tu",
      "ตู": "tuu",
      "เตะ": "te",
      "เต": "tee",
      "แตะ": "tae",
      "แต": "taae",
      "โตะ": "to",
      "โต": "too",
      "เตอะ": "toe",
      "เตอ": "tooe"
    },
    "spell": {
      "ตอ อะ": "ตะ",
      "ตอ อา": "ตา",
      "ตอ อิ": "ติ",
      "ตอ อี": "ตี",
      "ตอ อึ": "ตึ",
      "ตอ อื": "ตื",
      "ตอ อุ": "ตุ",
      "ตอ อู": "ตู",
      "ตอ เอะ": "เตะ",
      "ตอ เอ": "เต",
      "ตอ แอะ": "แตะ",
      "ตอ แอ": "แต",
      "ตอ โอะ": "โตะ",
      "ตอ โอ": "โต",
      "ตอ เออะ": "เตอะ",
      "ตอ เออ": "เตอ"
    },
    "vocab": {
      "word": "กะเฌอ",
      "roman": "kà-chəə",
      "mean": "木(古語)"
    },
    "tip": "ถのようだが閉じる"
  },
  {
    "id": 13,
    "char": "ญ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ญ หญิง",
      "roman": "yɔɔ yǐŋ",
      "tts": "ยอ หญิง"
    },
    "sound": {
      "init": "y",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ถะ": "tha",
      "ถา": "thaa",
      "ถิ": "thi",
      "ถี": "thii",
      "ถึ": "thue",
      "ถื": "thuue",
      "ถุ": "thu",
      "ถู": "thuu",
      "เถะ": "the",
      "เถ": "thee",
      "แถะ": "thae",
      "แถ": "thaae",
      "โถะ": "tho",
      "โถ": "thoo"
    },
    "spell": {
      "ถอ อะ": "ถะ",
      "ถอ อา": "ถา",
      "ถอ อิ": "ถิ",
      "ถอ อี": "ถี",
      "ถอ อึ": "ถึ",
      "ถอ อื": "ถื",
      "ถอ อุ": "ถุ",
      "ถอ อู": "ถู",
      "ถอ เอะ": "เถะ",
      "ถอ เอ": "เถ",
      "ถอ แอะ": "แถะ",
      "ถอ แอ": "แถ",
      "ถอ โอะ": "โถะ",
      "ถอ โอ": "โถ"
    },
    "vocab": {
      "word": "ผู้หญิง",
      "roman": "phûu-yǐŋ",
      "mean": "女性"
    },
    "tip": "ถの下に装飾がある"
  },
  {
    "id": 14,
    "char": "ฎ",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ฎ ชฎา",
      "roman": "dɔɔ chá-daa",
      "tts": "ดอ ชฎา"
    },
    "sound": {
      "init": "d",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ทะ": "tha",
      "ทา": "thaa",
      "ทิ": "thi",
      "ที": "thii",
      "ทึ": "thue",
      "ทื": "thuue",
      "ทุ": "thu",
      "ทู": "thuu",
      "เทะ": "the",
      "เท": "thee",
      "แทะ": "thae",
      "แท": "thaae",
      "โทะ": "tho",
      "โท": "thoo"
    },
    "spell": {
      "ทอ อะ": "ทะ",
      "ทอ อา": "ทา",
      "ทอ อิ": "ทิ",
      "ทอ อี": "ที",
      "ทอ อึ": "ทึ",
      "ทอ อื": "ทื",
      "ทอ อุ": "ทุ",
      "ทอ อู": "ทู",
      "ทอ เอะ": "เทะ",
      "ทอ เอ": "เท",
      "ทอ แอะ": "แทะ",
      "ทอ แอ": "แท",
      "ทอ โอะ": "โทะ",
      "ทอ โอ": "โท"
    },
    "vocab": {
      "word": "กฎ",
      "roman": "kòt",
      "mean": "規則"
    },
    "tip": "ดと同じ音・下が一回巻く"
  },
  {
    "id": 15,
    "char": "ฏ",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ฏ ปฏัก",
      "roman": "tɔɔ pà-tàk",
      "tts": "ตอ ปฏัก"
    },
    "sound": {
      "init": "t",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "นะ": "na",
      "นา": "naa",
      "นิ": "ni",
      "นี": "nii",
      "นึ": "nue",
      "นื": "nuue",
      "นุ": "nu",
      "นู": "nuu",
      "เนะ": "ne",
      "เน": "nee",
      "แนะ": "nae",
      "แน": "naae",
      "โนะ": "no",
      "โน": "noo",
      "เนอะ": "noe",
      "เนอ": "nooe"
    },
    "spell": {
      "นอ อะ": "นะ",
      "นอ อา": "นา",
      "นอ อิ": "นิ",
      "นอ อี": "นี",
      "นอ อึ": "นึ",
      "นอ อื": "นื",
      "นอ อุ": "นุ",
      "นอ อู": "นู",
      "นอ เอะ": "เนะ",
      "นอ เอ": "เน",
      "นอ แอะ": "แนะ",
      "นอ แอ": "แน",
      "นอ โอะ": "โนะ",
      "นอ โอ": "โน",
      "นอ เออะ": "เนอะ",
      "นอ เออ": "เนอ"
    },
    "vocab": {
      "word": "ปรากฏ",
      "roman": "praa-kòt",
      "mean": "現れる"
    },
    "tip": "ตと同じ音・下が一回巻く"
  },
  {
    "id": 16,
    "char": "ฐ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ฐ ฐาน",
      "roman": "thɔ̌ɔ thǎan",
      "tts": "ถอ ฐาน"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "บะ": "ba",
      "บา": "baa",
      "บิ": "bi",
      "บี": "bii",
      "บึ": "bue",
      "บื": "buue",
      "บุ": "bu",
      "บู": "buu",
      "เบะ": "be",
      "เบ": "bee",
      "แบะ": "bae",
      "แบ": "baae",
      "โบะ": "bo",
      "โบ": "boo",
      "เบอะ": "boe",
      "เบอ": "booe"
    },
    "spell": {
      "บอ อะ": "บะ",
      "บอ อา": "บา",
      "บอ อิ": "บิ",
      "บอ อี": "บี",
      "บอ อึ": "บึ",
      "บอ อื": "บื",
      "บอ อุ": "บุ",
      "บอ อู": "บู",
      "บอ เอะ": "เบะ",
      "บอ เอ": "เบ",
      "บอ แอะ": "แบะ",
      "บอ แอ": "แบ",
      "บอ โอะ": "โบะ",
      "บอ โอ": "โบ",
      "บอ เออะ": "เบอะ",
      "บอ เออ": "เบอ"
    },
    "vocab": {
      "word": "ฐาน",
      "roman": "thǎan",
      "mean": "基礎/土台"
    },
    "tip": "下に台座がある"
  },
  {
    "id": 17,
    "char": "ฑ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฑ มณโฑ",
      "roman": "thɔɔ mon-thoo",
      "tts": "ทอ มณโฑ"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ปะ": "pa",
      "ปา": "paa",
      "ปิ": "pi",
      "ปี": "pii",
      "ปึ": "pue",
      "ปื": "puue",
      "ปุ": "pu",
      "ปู": "puu",
      "เปะ": "pe",
      "เป": "pee",
      "แปะ": "pae",
      "แป": "paae",
      "โปะ": "po",
      "โป": "poo",
      "เปอะ": "poe",
      "เปอ": "pooe"
    },
    "spell": {
      "ปอ อะ": "ปะ",
      "ปอ อา": "ปา",
      "ปอ อิ": "ปิ",
      "ปอ อี": "ปี",
      "ปอ อึ": "ปึ",
      "ปอ อื": "ปื",
      "ปอ อุ": "ปุ",
      "ปอ อู": "ปู",
      "ปอ เอะ": "เปะ",
      "ปอ เอ": "เป",
      "ปอ แอะ": "แปะ",
      "ปอ แอ": "แป",
      "ปอ โอะ": "โปะ",
      "ปอ โอ": "โป",
      "ปอ เออะ": "เปอะ",
      "ปอ เออ": "เปอ"
    },
    "vocab": {
      "word": "มณโฑ",
      "roman": "mon-thoo",
      "mean": "巨人夜叉の妻"
    },
    "tip": "ทの頭が割れた形"
  },
  {
    "id": 18,
    "char": "ฒ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฒ ผู้เฒ่า",
      "roman": "thɔɔ phûu-thâo",
      "tts": "ทอ ผู้เฒ่า"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ผะ": "pha",
      "ผา": "phaa",
      "ผิ": "phi",
      "ผี": "phii",
      "ผึ": "phue",
      "ผื": "phuue",
      "ผุ": "phu",
      "ผู": "phuu",
      "เผะ": "phe",
      "เผ": "phee",
      "แผะ": "phae",
      "แผ": "phaae",
      "โผะ": "pho",
      "โผ": "phoo"
    },
    "spell": {
      "ผอ อะ": "ผะ",
      "ผอ อา": "ผา",
      "ผอ อิ": "ผิ",
      "ผอ อี": "ผี",
      "ผอ อึ": "ผึ",
      "ผอ อื": "ผื",
      "ผอ อุ": "ผุ",
      "ผอ อู": "ผู",
      "ผอ เอะ": "เผะ",
      "ผอ เอ": "เผ",
      "ผอ แอะ": "แผะ",
      "ผอ แอ": "แผ",
      "ผอ โอะ": "โผะ",
      "ผอ โอ": "โผ"
    },
    "vocab": {
      "word": "ผู้เฒ่า",
      "roman": "phûu-thâo",
      "mean": "老人"
    },
    "tip": "ตの下が巻く"
  },
  {
    "id": 19,
    "char": "ณ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ณ เณร",
      "roman": "nɔɔ neen",
      "tts": "นอ เณร"
    },
    "sound": {
      "init": "n",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฝะ": "fa",
      "ฝา": "faa",
      "ฝิ": "fi",
      "ฝี": "fii",
      "ฝึ": "fue",
      "ฝื": "fuue",
      "ฝุ": "fu",
      "ฝู": "fuu",
      "เฝะ": "fe",
      "เฝ": "fee",
      "แฝะ": "fae",
      "แฝ": "faae",
      "โฝะ": "fo",
      "โฝ": "foo"
    },
    "spell": {
      "ฝอ อะ": "ฝะ",
      "ฝอ อา": "ฝา",
      "ฝอ อิ": "ฝิ",
      "ฝอ อี": "ฝี",
      "ฝอ อึ": "ฝึ",
      "ฝอ อื": "ฝื",
      "ฝอ อุ": "ฝุ",
      "ฝอ อู": "ฝู",
      "ฝอ เอะ": "เฝะ",
      "ฝอ เอ": "เฝ",
      "ฝอ แอะ": "แฝะ",
      "ฝอ แอ": "แฝ",
      "ฝอ โอะ": "โฝะ",
      "ฝอ โอ": "โฝ"
    },
    "vocab": {
      "word": "สามเณร",
      "roman": "sǎa-má-neen",
      "mean": "少年僧"
    },
    "tip": "ถの下が巻く"
  },
  {
    "id": 20,
    "char": "ด",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ด เด็ก",
      "roman": "dɔɔ dèk",
      "tts": "ดอ เด็ก"
    },
    "sound": {
      "init": "d",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "พะ": "pha",
      "พา": "phaa",
      "พิ": "phi",
      "พี": "phii",
      "พึ": "phue",
      "พื": "phuue",
      "พุ": "phu",
      "พู": "phuu",
      "เพะ": "phe",
      "เพ": "phee",
      "แพะ": "phae",
      "แพ": "phaae",
      "โพะ": "pho",
      "โพ": "phoo",
      "เพอะ": "phoe",
      "เพอ": "phooe"
    },
    "spell": {
      "พอ อะ": "พะ",
      "พอ อา": "พา",
      "พอ อิ": "พิ",
      "พอ อี": "พี",
      "พอ อึ": "พึ",
      "พอ อื": "พื",
      "พอ อุ": "พุ",
      "พอ อู": "พู",
      "พอ เอะ": "เพะ",
      "พอ เอ": "เพ",
      "พอ แอะ": "แพะ",
      "พอ แอ": "แพ",
      "พอ โอะ": "โพะ",
      "พอ โอ": "โพ",
      "พอ เออะ": "เพอะ",
      "พอ เออ": "เพอ"
    },
    "vocab": {
      "word": "เด็ก",
      "roman": "dèk",
      "mean": "子供"
    },
    "tip": "頭が内側・丸い"
  },
  {
    "id": 21,
    "char": "ต",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ต เต่า",
      "roman": "tɔɔ tào",
      "tts": "ตอ เต่า"
    },
    "sound": {
      "init": "t",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฟะ": "fa",
      "ฟา": "faa",
      "ฟิ": "fi",
      "ฟี": "fii",
      "ฟึ": "fue",
      "ฟื": "fuue",
      "ฟุ": "fu",
      "ฟู": "fuu",
      "เฟะ": "fe",
      "เฟ": "fee",
      "แฟะ": "fae",
      "แฟ": "faae",
      "โฟะ": "fo",
      "โฟ": "foo"
    },
    "spell": {
      "ฟอ อะ": "ฟะ",
      "ฟอ อา": "ฟา",
      "ฟอ อิ": "ฟิ",
      "ฟอ อี": "ฟี",
      "ฟอ อึ": "ฟึ",
      "ฟอ อื": "ฟื",
      "ฟอ อุ": "ฟุ",
      "ฟอ อู": "ฟู",
      "ฟอ เอะ": "เฟะ",
      "ฟอ เอ": "เฟ",
      "ฟอ แอะ": "แฟะ",
      "ฟอ แอ": "แฟ",
      "ฟอ โอะ": "โฟะ",
      "ฟอ โอ": "โฟ"
    },
    "vocab": {
      "word": "เต่า",
      "roman": "tào",
      "mean": "亀"
    },
    "tip": "ดの頭が割れた形"
  },
  {
    "id": 22,
    "char": "ถ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ถ ถุง",
      "roman": "thɔ̌ɔ thǔŋ",
      "tts": "ถอ ถุง"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "มะ": "ma",
      "มา": "maa",
      "มิ": "mi",
      "มี": "mii",
      "มึ": "mue",
      "มื": "muue",
      "มุ": "mu",
      "มู": "muu",
      "เมะ": "me",
      "เม": "mee",
      "แมะ": "mae",
      "แม": "maae",
      "โมะ": "mo",
      "โม": "moo",
      "เมอะ": "moe",
      "เมอ": "mooe"
    },
    "spell": {
      "ภอ อะ": "ภะ",
      "ภอ อา": "ภา",
      "ภอ อิ": "ภิ",
      "ภอ อี": "ภี",
      "ภอ อึ": "ภึ",
      "ภอ อื": "ภื",
      "ภอ อุ": "ภุ",
      "ภอ อู": "ภู",
      "ภอ เอะ": "เภะ",
      "ภอ เอ": "เภ",
      "ภอ แอะ": "แภะ",
      "ภอ แอ": "แภ",
      "ภอ โอะ": "โภะ",
      "ภอ โอ": "โภ",
      "ภอ เออะ": "เภอะ",
      "ภอ เออ": "เภอ"
    },
    "vocab": {
      "word": "ถุง",
      "roman": "thǔŋ",
      "mean": "袋"
    },
    "tip": "กの頭に丸がある"
  },
  {
    "id": 23,
    "char": "ท",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ท ทหาร",
      "roman": "thɔɔ thá-hǎan",
      "tts": "ทอ ทหาร"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ยะ": "ya",
      "ยา": "yaa",
      "ยิ": "yi",
      "ยี": "yii",
      "ยึ": "yue",
      "ยื": "yuue",
      "ยุ": "yu",
      "ยู": "yuu",
      "เยะ": "ye",
      "เย": "yee",
      "แยะ": "yae",
      "แย": "yaae",
      "โยะ": "yo",
      "โย": "yoo"
    },
    "spell": {
      "มอ อะ": "มะ",
      "มอ อา": "มา",
      "มอ อิ": "มิ",
      "มอ อี": "มี",
      "มอ อึ": "มึ",
      "มอ อื": "มื",
      "มอ อุ": "มุ",
      "มอ อู": "มู",
      "มอ เอะ": "เมะ",
      "มอ เอ": "เม",
      "มอ แอะ": "แมะ",
      "มอ แอ": "แม",
      "มอ โอะ": "โมะ",
      "มอ โอ": "โม",
      "มอ เออะ": "เมอะ",
      "มอ เออ": "เมอ"
    },
    "vocab": {
      "word": "ทหาร",
      "roman": "thá-hǎan",
      "mean": "軍人/兵士"
    },
    "tip": "頭が外側・角張る"
  },
  {
    "id": 24,
    "char": "ธ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ธ ธง",
      "roman": "thɔɔ thoŋ",
      "tts": "ทอ ธง"
    },
    "sound": {
      "init": "th",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ระ": "ra",
      "รา": "raa",
      "ริ": "ri",
      "รี": "rii",
      "รึ": "rue",
      "รื": "ruue",
      "รุ": "ru",
      "รู": "ruu",
      "เระ": "re",
      "เร": "ree",
      "แระ": "rae",
      "แร": "raae",
      "โระ": "ro",
      "โร": "roo",
      "เรอะ": "roe",
      "เรอ": "rooe"
    },
    "spell": {
      "ยอ อะ": "ยะ",
      "ยอ อา": "ยา",
      "ยอ อิ": "ยิ",
      "ยอ อี": "ยี",
      "ยอ อึ": "ยึ",
      "ยอ อื": "ยื",
      "ยอ อุ": "ยุ",
      "ยอ อู": "ยู",
      "ยอ เอะ": "เยะ",
      "ยอ เอ": "เย",
      "ยอ แอะ": "แยะ",
      "ยอ แอ": "แย",
      "ยอ โอะ": "โยะ",
      "ยอ โอ": "โย",
      "ยอ เออะ": "เยอะ",
      "ยอ เออ": "เยอ"
    },
    "vocab": {
      "word": "ธง",
      "roman": "thoŋ",
      "mean": "旗"
    },
    "tip": "bのような形"
  },
  {
    "id": 25,
    "char": "น",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "น หนู",
      "roman": "nɔɔ nǔu",
      "tts": "นอ หนู"
    },
    "sound": {
      "init": "n",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ละ": "la",
      "ลา": "laa",
      "ลิ": "li",
      "ลี": "lii",
      "ลึ": "lue",
      "ลื": "luue",
      "ลุ": "lu",
      "ลู": "luu",
      "เละ": "le",
      "เล": "lee",
      "และ": "lae",
      "แล": "laae",
      "โละ": "lo",
      "โล": "loo",
      "เลอะ": "loe",
      "เลอ": "looe"
    },
    "spell": {
      "รอ อะ": "ระ",
      "รอ อา": "รา",
      "รอ อิ": "ริ",
      "รอ อี": "รี",
      "รอ อึ": "รึ",
      "รอ อื": "รื",
      "รอ อุ": "รุ",
      "รอ อู": "รู",
      "รอ เอะ": "เระ",
      "รอ เอ": "เร",
      "รอ แอะ": "แระ",
      "รอ แอ": "แร",
      "รอ โอะ": "โระ",
      "รอ โอ": "โร",
      "รอ เออะ": "เรอะ",
      "รอ เออ": "เรอ"
    },
    "vocab": {
      "word": "หนู",
      "roman": "nǔu",
      "mean": "ねずみ/私"
    },
    "tip": "ไข่に尻尾の丸"
  },
  {
    "id": 26,
    "char": "บ",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "บ ใบไม้",
      "roman": "bɔɔ bai-máai",
      "tts": "บอ ใบไม้"
    },
    "sound": {
      "init": "b",
      "final": "p"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "วะ": "wa",
      "วา": "waa",
      "วิ": "wi",
      "วี": "wii",
      "วึ": "wue",
      "วื": "wuue",
      "วุ": "wu",
      "วู": "wuu",
      "เวะ": "we",
      "เว": "wee",
      "แวะ": "wae",
      "แว": "waae",
      "โวะ": "wo",
      "โว": "woo"
    },
    "spell": {
      "ลอ อะ": "ละ",
      "ลอ อา": "ลา",
      "ลอ อิ": "ลิ",
      "ลอ อี": "ลี",
      "ลอ อึ": "ลึ",
      "ลอ อื": "ลื",
      "ลอ อุ": "ลุ",
      "ลอ อู": "ลู",
      "ลอ เอะ": "เละ",
      "ลอ เอ": "เล",
      "ลอ แอะ": "และ",
      "ลอ แอ": "แล",
      "ลอ โอะ": "โละ",
      "ลอ โอ": "โล",
      "ลอ เออะ": "เลอะ",
      "ลอ เออ": "เลอ"
    },
    "vocab": {
      "word": "ใบไม้",
      "roman": "bai-máai",
      "mean": "葉っぱ"
    },
    "tip": "幅が狭い・お尻が平ら"
  },
  {
    "id": 27,
    "char": "ป",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "ป ปลา",
      "roman": "pɔɔ plaa",
      "tts": "ปอ ปลา"
    },
    "sound": {
      "init": "p",
      "final": "p"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "สะ": "sa",
      "สา": "saa",
      "สิ": "si",
      "สี": "sii",
      "สึ": "sue",
      "สื": "suue",
      "สุ": "su",
      "สู": "suu",
      "เสะ": "se",
      "เส": "see",
      "แสะ": "sae",
      "แส": "saae",
      "โสะ": "so",
      "โส": "soo",
      "เสอะ": "soe",
      "เสอ": "sooe"
    },
    "spell": {
      "วอ อะ": "วะ",
      "วอ อา": "วา",
      "วอ อิ": "วิ",
      "วอ อี": "วี",
      "วอ อึ": "วึ",
      "วอ อื": "วื",
      "วอ อุ": "วุ",
      "วอ อู": "วู",
      "วอ เอะ": "เวะ",
      "วอ เอ": "เว",
      "วอ แอะ": "แวะ",
      "วอ แอ": "แว",
      "วอ โอะ": "โวะ",
      "วอ โอ": "โว",
      "วอ เออะ": "เวอะ",
      "วอ เออ": "เวอ"
    },
    "vocab": {
      "word": "ปลา",
      "roman": "plaa",
      "mean": "魚"
    },
    "tip": "บの尻尾が長い"
  },
  {
    "id": 28,
    "char": "ผ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ผ ผึ้ง",
      "roman": "phɔ̌ɔ phʉ̂ŋ",
      "tts": "ผอ ผึ้ง"
    },
    "sound": {
      "init": "ph",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "หะ": "ha",
      "หา": "haa",
      "หิ": "hi",
      "หี": "hii",
      "หึ": "hue",
      "หื": "huue",
      "หุ": "hu",
      "หู": "huu",
      "เหะ": "he",
      "เห": "hee",
      "แหะ": "hae",
      "แห": "haae",
      "โหะ": "ho",
      "โห": "hoo",
      "เหอะ": "hoe",
      "เหอ": "hooe"
    },
    "spell": {
      "สอ อะ": "สะ",
      "สอ อา": "สา",
      "สอ อิ": "สิ",
      "สอ อี": "สี",
      "สอ อึ": "สึ",
      "สอ อื": "สื",
      "สอ อุ": "สุ",
      "สอ อู": "สู",
      "สอ เอะ": "เสะ",
      "สอ เอ": "เส",
      "สอ แอะ": "แสะ",
      "สอ แอ": "แส",
      "สอ โอะ": "โสะ",
      "สอ โอ": "โส",
      "สอ เออะ": "เสอะ",
      "สอ เออ": "เสอ"
    },
    "vocab": {
      "word": "ผึ้ง",
      "roman": "phʉ̂ŋ",
      "mean": "蜂"
    },
    "tip": "内巻き・線は上までいかない"
  },
  {
    "id": 29,
    "char": "ฝ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ฝ ฝา",
      "roman": "fɔ̌ɔ fǎa",
      "tts": "ฝอ ฝา"
    },
    "sound": {
      "init": "f",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "อะ": "a",
      "อา": "aa",
      "อิ": "i",
      "อี": "ii",
      "อึ": "ue",
      "อื": "uue",
      "อุ": "u",
      "อู": "uu",
      "เอะ": "e",
      "เอ": "ee",
      "แอะ": "ae",
      "แอ": "aae",
      "โอะ": "o",
      "โอ": "oo",
      "เออะ": "oe",
      "เออ": "ooe"
    },
    "spell": {
      "หอ อะ": "หะ",
      "หอ อา": "หา",
      "หอ อิ": "หิ",
      "หอ อี": "หี",
      "หอ อึ": "หึ",
      "หอ อื": "หื",
      "หอ อุ": "หุ",
      "หอ อู": "หู",
      "หอ เอะ": "เหะ",
      "หอ เอ": "เห",
      "หอ แอะ": "แหะ",
      "หอ แอ": "แห",
      "หอ โอะ": "โหะ",
      "หอ โอ": "โห",
      "หอ เออะ": "เหอะ",
      "หอ เออ": "เหอ"
    },
    "vocab": {
      "word": "ฝา",
      "roman": "fǎa",
      "mean": "蓋"
    },
    "tip": "ผの尻尾が長い"
  },
  {
    "id": 30,
    "char": "พ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "พ พาน",
      "roman": "phɔɔ phaan",
      "tts": "พอ พาน"
    },
    "sound": {
      "init": "ph",
      "final": "p"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฮะ": "ha",
      "ฮา": "haa",
      "ฮิ": "hi",
      "ฮี": "hii",
      "ฮึ": "hue",
      "ฮื": "huue",
      "ฮุ": "hu",
      "ฮู": "huu",
      "เฮะ": "he",
      "เฮ": "hee",
      "แฮะ": "hae",
      "แฮ": "haae",
      "โฮะ": "ho",
      "โฮ": "hoo"
    },
    "spell": {
      "ฬอ อะ": "ฬะ",
      "ฬอ อา": "ฬา",
      "ฬอ อิ": "ฬิ",
      "ฬอ อี": "ฬี",
      "ฬอ อึ": "ฬึ",
      "ฬอ อื": "ฬื",
      "ฬอ อุ": "ฬุ",
      "ฬอ อู": "ฬู",
      "ฬอ เอะ": "เฬะ",
      "ฬอ เอ": "เฬ",
      "ฬอ แอะ": "แฬะ",
      "ฬอ แอ": "แฬ",
      "ฬอ โอะ": "โฬะ",
      "ฬอ โอ": "โฬ"
    },
    "vocab": {
      "word": "พาน",
      "roman": "phaan",
      "mean": "お盆/台"
    },
    "tip": "ผの外開き版"
  },
  {
    "id": 31,
    "char": "ฟ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฟ ฟัน",
      "roman": "fɔɔ fan",
      "tts": "ฟอ ฟัน"
    },
    "sound": {
      "init": "f",
      "final": "p"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฟะ": "fa",
      "ฟา": "faa",
      "ฟิ": "fi",
      "ฟี": "fii",
      "ฟึ": "fue",
      "ฟื": "fuue",
      "ฟุ": "fu",
      "ฟู": "fuu",
      "เฟะ": "fe",
      "เฟ": "fee",
      "แฟะ": "fae",
      "แฟ": "faae",
      "โฟะ": "fo",
      "โฟ": "foo",
      "เฟอะ": "foe",
      "เฟอ": "fooe"
    },
    "spell": {
      "อะ": "อะ",
      "อา": "อา",
      "อิ": "อิ",
      "อี": "อี",
      "อึ": "อึ",
      "อื": "อื",
      "อุ": "อุ",
      "อู": "อู",
      "เอะ": "เอะ",
      "เอ": "เอ",
      "แอะ": "แอะ",
      "แอ": "แอ",
      "โอะ": "โอะ",
      "โอ": "โอ",
      "เออะ": "เออะ",
      "เออ": "เออ"
    },
    "vocab": {
      "word": "ฟัน",
      "roman": "fan",
      "mean": "歯"
    },
    "tip": "พの尻尾が長い"
  },
  {
    "id": 32,
    "char": "ภ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ภ สำเภา",
      "roman": "phɔɔ sǎm-phao",
      "tts": "พอ สำเภา"
    },
    "sound": {
      "init": "ph",
      "final": "p"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ภะ": "pha",
      "ภา": "phaa",
      "ภิ": "phi",
      "ภี": "phii",
      "ภึ": "phue",
      "ภื": "phuue",
      "ภุ": "phu",
      "ภู": "phuu",
      "เภะ": "phe",
      "เภ": "phee",
      "แภะ": "phae",
      "แภ": "phaae",
      "โภะ": "pho",
      "โภ": "phoo",
      "เภอะ": "phoe",
      "เภอ": "phooe"
    },
    "spell": {
      "ฮอ อะ": "ฮะ",
      "ฮอ อา": "ฮา",
      "ฮอ อิ": "ฮิ",
      "ฮอ อี": "ฮี",
      "ฮอ อึ": "ฮึ",
      "ฮอ อื": "ฮื",
      "ฮอ อุ": "ฮุ",
      "ฮอ อู": "ฮู",
      "ฮอ เอะ": "เฮะ",
      "ฮอ เอ": "เฮ",
      "ฮอ แอะ": "แฮะ",
      "ฮอ แอ": "แฮ",
      "ฮอ โอะ": "โฮะ",
      "ฮอ โอ": "โฮ",
      "ฮอ เออะ": "เฮอะ",
      "ฮอ เออ": "เฮอ"
    },
    "vocab": {
      "word": "สำเภา",
      "roman": "sǎm-phao",
      "mean": "帆船"
    },
    "tip": "ถの頭が外側"
  },
  {
    "id": 33,
    "char": "ม",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ม ม้า",
      "roman": "mɔɔ máa",
      "tts": "มอ ม้า"
    },
    "sound": {
      "init": "m",
      "final": "m"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "มะ": "ma",
      "มา": "maa",
      "มิ": "mi",
      "มี": "mii",
      "มึ": "mue",
      "มื": "muue",
      "มุ": "mu",
      "มู": "muu",
      "เมะ": "me",
      "เม": "mee",
      "แมะ": "mae",
      "แม": "maae",
      "โมะ": "mo",
      "โม": "moo",
      "เมอะ": "moe",
      "เมอ": "mooe"
    },
    "spell": {
      "ศอ อะ": "ศะ",
      "ศอ อา": "ศา",
      "ศอ อิ": "ศิ",
      "ศอ อี": "ศี",
      "ศอ อึ": "ศึ",
      "ศอ อื": "ศื",
      "ศอ อุ": "ศุ",
      "ศอ อู": "ศู",
      "ศอ เอะ": "เศะ",
      "ศอ เอ": "เศ",
      "ศอ แอะ": "แศะ",
      "ศอ แอ": "แศ",
      "ศอ โอะ": "โศะ",
      "ศอ โอ": "โศ",
      "ศอ เออะ": "เศอะ",
      "ศอ เออ": "เศอ"
    },
    "vocab": {
      "word": "ม้า",
      "roman": "máa",
      "mean": "馬"
    },
    "tip": "丸が2つある"
  },
  {
    "id": 34,
    "char": "ย",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ย ยักษ์",
      "roman": "yɔɔ yák",
      "tts": "ยอ ยักษ์"
    },
    "sound": {
      "init": "y",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ยะ": "ya",
      "ยา": "yaa",
      "ยิ": "yi",
      "ยี": "yii",
      "ยึ": "yue",
      "ยื": "yuue",
      "ยุ": "yu",
      "ยู": "yuu",
      "เยะ": "ye",
      "เย": "yee",
      "แยะ": "yae",
      "แย": "yaae",
      "โยะ": "yo",
      "โย": "yoo",
      "เยอะ": "yoe",
      "เยอ": "yooe"
    },
    "spell": {
      "ษอ อะ": "ษะ",
      "ษอ อา": "ษา",
      "ษอ อิ": "ษิ",
      "ษอ อี": "ษี",
      "ษอ อึ": "ษึ",
      "ษอ อื": "ษื",
      "ษอ อุ": "ษุ",
      "ษอ อู": "ษู",
      "ษอ เอะ": "เษะ",
      "ษอ เอ": "เษ",
      "ษอ แอะ": "แษะ",
      "ษอ แอ": "แษ",
      "ษอ โอะ": "โษะ",
      "ษอ โอ": "โษ",
      "ษอ เออะ": "เษอะ",
      "ษอ เออ": "เษอ"
    },
    "vocab": {
      "word": "ยักษ์",
      "roman": "yák",
      "mean": "夜叉/鬼"
    },
    "tip": "ขの下が巻く"
  },
  {
    "id": 35,
    "char": "ร",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ร เรือ",
      "roman": "rɔɔ rʉa",
      "tts": "รอ เรือ"
    },
    "sound": {
      "init": "r",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ระ": "ra",
      "รา": "raa",
      "ริ": "ri",
      "รี": "rii",
      "รึ": "rue",
      "รื": "ruue",
      "รุ": "ru",
      "รู": "ruu",
      "เระ": "re",
      "เร": "ree",
      "แระ": "rae",
      "แร": "raae",
      "โระ": "ro",
      "โร": "roo",
      "เรอะ": "roe",
      "เรอ": "rooe"
    },
    "spell": {
      "รอ อะ": "ระ",
      "รอ อา": "รา",
      "รอ อิ": "ริ",
      "รอ อี": "รี",
      "รอ อึ": "รึ",
      "รอ อื": "รื",
      "รอ อุ": "รุ",
      "รอ อู": "รู",
      "รอ เอะ": "เระ",
      "รอ เอ": "เร",
      "รอ แอะ": "แระ",
      "รอ แอ": "แร",
      "รอ โอะ": "โระ",
      "รอ โอ": "โร",
      "รอ เออะ": "เรอะ",
      "รอ เออ": "เรอ"
    },
    "vocab": {
      "word": "เรือ",
      "roman": "rʉa",
      "mean": "船"
    },
    "tip": "S字のような形"
  },
  {
    "id": 36,
    "char": "ล",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ล ลิง",
      "roman": "lɔɔ liŋ",
      "tts": "ลอ ลิง"
    },
    "sound": {
      "init": "l",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ละ": "la",
      "ลา": "laa",
      "ลิ": "li",
      "ลี": "lii",
      "ลึ": "lue",
      "ลื": "luue",
      "ลุ": "lu",
      "ลู": "luu",
      "เละ": "le",
      "เล": "lee",
      "และ": "lae",
      "แล": "laae",
      "โละ": "lo",
      "โล": "loo",
      "เลอะ": "loe",
      "เลอ": "looe"
    },
    "spell": {
      "ลอ อะ": "ละ",
      "ลอ อา": "ลา",
      "ลอ อิ": "ลิ",
      "ลอ อี": "ลี",
      "ลอ อึ": "ลึ",
      "ลอ อื": "ลื",
      "ลอ อุ": "ลุ",
      "ลอ อู": "ลู",
      "ลอ เอะ": "เละ",
      "ลอ เอ": "เล",
      "ลอ แอะ": "และ",
      "ลอ แอ": "แล",
      "ลอ โอะ": "โละ",
      "ลอ โอ": "โล",
      "ลอ เออะ": "เลอะ",
      "ลอ เออ": "เลอ"
    },
    "vocab": {
      "word": "ลิง",
      "roman": "liŋ",
      "mean": "猿"
    },
    "tip": "สのヒゲ無し"
  },
  {
    "id": 37,
    "char": "ว",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ว แหวน",
      "roman": "wɔɔ wɛ̌ɛn",
      "tts": "วอ แหวน"
    },
    "sound": {
      "init": "w",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "วะ": "wa",
      "วา": "waa",
      "วิ": "wi",
      "วี": "wii",
      "วึ": "wue",
      "วื": "wuue",
      "วุ": "wu",
      "วู": "wuu",
      "เวะ": "we",
      "เว": "wee",
      "แวะ": "wae",
      "แว": "waae",
      "โวะ": "wo",
      "โว": "woo",
      "เวอะ": "woe",
      "เวอ": "wooe"
    },
    "spell": {
      "วอ อะ": "วะ",
      "วอ อา": "วา",
      "วอ อิ": "วิ",
      "วอ อี": "วี",
      "วอ อึ": "วึ",
      "วอ อื": "วื",
      "วอ อุ": "วุ",
      "วอ อู": "วู",
      "วอ เอะ": "เวะ",
      "วอ เอ": "เว",
      "วอ แอะ": "แวะ",
      "วอ แอ": "แว",
      "วอ โอะ": "โวะ",
      "วอ โอ": "โว",
      "วอ เออะ": "เวอะ",
      "วอ เออ": "เวอ"
    },
    "vocab": {
      "word": "แหวน",
      "roman": "wɛ̌ɛn",
      "mean": "指輪"
    },
    "tip": "頭が下・屋根あり"
  },
  {
    "id": 38,
    "char": "ศ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ศ ศาลา",
      "roman": "sɔ̌ɔ sǎa-laa",
      "tts": "ศอ ศาลา"
    },
    "sound": {
      "init": "s",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ศะ": "sa",
      "ศา": "saa",
      "ศิ": "si",
      "ศี": "sii",
      "ศึ": "sue",
      "ศื": "suue",
      "ศุ": "su",
      "ศู": "suu",
      "เศะ": "se",
      "เศ": "see",
      "แศะ": "sae",
      "แศ": "saae",
      "โศะ": "so",
      "โศ": "soo",
      "เศอะ": "soe",
      "เศอ": "sooe"
    },
    "spell": {
      "ศอ อะ": "ศะ",
      "ศอ อา": "ศา",
      "ศอ อิ": "ศิ",
      "ศอ อี": "ศี",
      "ศอ อึ": "ศึ",
      "ศอ อื": "ศื",
      "ศอ อุ": "ศุ",
      "ศอ อู": "ศู",
      "ศอ เอะ": "เศะ",
      "ศอ เอ": "เศ",
      "ศอ แอะ": "แศะ",
      "ศอ แอ": "แศ",
      "ศอ โอะ": "โศะ",
      "ศอ โอ": "โศ",
      "ศอ เออะ": "เศอะ",
      "ศอ เออ": "เศอ"
    },
    "vocab": {
      "word": "ศาลา",
      "roman": "sǎa-laa",
      "mean": "休憩所"
    },
    "tip": "คの頭にヒゲがある"
  },
  {
    "id": 39,
    "char": "ษ",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ษ ฤๅษี",
      "roman": "sɔ̌ɔ rʉʉ-sǐi",
      "tts": "สอ ฤๅษี"
    },
    "sound": {
      "init": "s",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ษะ": "sa",
      "ษา": "saa",
      "ษิ": "si",
      "ษี": "sii",
      "ษึ": "sue",
      "ษื": "suue",
      "ษุ": "su",
      "ษู": "suu",
      "เษะ": "se",
      "เษ": "see",
      "แษะ": "sae",
      "แษ": "saae",
      "โษะ": "so",
      "โษ": "soo",
      "เษอะ": "soe",
      "เษอ": "sooe"
    },
    "spell": {
      "ษอ อะ": "ษะ",
      "ษอ อา": "ษา",
      "ษอ อิ": "ษิ",
      "ษอ อี": "ษี",
      "ษอ อึ": "ษึ",
      "ษอ อื": "ษื",
      "ษอ อุ": "ษุ",
      "ษอ อู": "ษู",
      "ษอ เอะ": "เษะ",
      "ษอ เอ": "เษ",
      "ษอ แอะ": "แษะ",
      "ษอ แอ": "แษ",
      "ษอ โอะ": "โษะ",
      "ษอ โอ": "โษ",
      "ษอ เออะ": "เษอะ",
      "ษอ เออ": "เษอ"
    },
    "vocab": {
      "word": "ภาษา",
      "roman": "phaa-sǎa",
      "mean": "言語"
    },
    "tip": "บの中に詰め物がある"
  },
  {
    "id": 40,
    "char": "ส",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ส เสือ",
      "roman": "sɔ̌ɔ sʉ̌a",
      "tts": "สอ เสือ"
    },
    "sound": {
      "init": "s",
      "final": "t"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "สะ": "sa",
      "สา": "saa",
      "สิ": "si",
      "สี": "sii",
      "สึ": "sue",
      "สื": "suue",
      "สุ": "su",
      "สู": "suu",
      "เสะ": "se",
      "เส": "see",
      "แสะ": "sae",
      "แส": "saae",
      "โสะ": "so",
      "โส": "soo",
      "เสอะ": "soe",
      "เสอ": "sooe"
    },
    "spell": {
      "สอ อะ": "สะ",
      "สอ อา": "สา",
      "สอ อิ": "สิ",
      "สอ อี": "สี",
      "สอ อึ": "สึ",
      "สอ อื": "สื",
      "สอ อุ": "สุ",
      "สอ อู": "สู",
      "สอ เอะ": "เสะ",
      "สอ เอ": "เส",
      "สอ แอะ": "แสะ",
      "สอ แอ": "แส",
      "สอ โอะ": "โสะ",
      "สอ โอ": "โส",
      "สอ เออะ": "เสอะ",
      "สอ เออ": "เสอ"
    },
    "vocab": {
      "word": "เสือ",
      "roman": "sʉ̌a",
      "mean": "虎"
    },
    "tip": "ลิงにヒゲがある"
  },
  {
    "id": 41,
    "char": "ห",
    "type": "Consonant",
    "class": "High",
    "name": {
      "thai": "ห หีบ",
      "roman": "hɔ̌ɔ hìip",
      "tts": "หอ หีบ"
    },
    "sound": {
      "init": "h",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "หะ": "ha",
      "หา": "haa",
      "หิ": "hi",
      "หี": "hii",
      "หึ": "hue",
      "หื": "huue",
      "หุ": "hu",
      "หู": "huu",
      "เหะ": "he",
      "เห": "hee",
      "แหะ": "hae",
      "แห": "haae",
      "โหะ": "ho",
      "โห": "hoo",
      "เหอะ": "hoe",
      "เหอ": "hooe"
    },
    "spell": {
      "หอ อะ": "หะ",
      "หอ อา": "หา",
      "หอ อิ": "หิ",
      "หอ อี": "หี",
      "หอ อึ": "หึ",
      "หอ อื": "หื",
      "หอ อุ": "หุ",
      "หอ อู": "หู",
      "หอ เอะ": "เหะ",
      "หอ เอ": "เห",
      "หอ แอะ": "แหะ",
      "หอ แอ": "แห",
      "หอ โอะ": "โหะ",
      "หอ โอ": "โห",
      "หอ เออะ": "เหอะ",
      "หอ เออ": "เหอ"
    },
    "vocab": {
      "word": "หีบ",
      "roman": "hìip",
      "mean": "箱"
    },
    "tip": "頭と尻尾に丸がある"
  },
  {
    "id": 42,
    "char": "ฬ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฬ จุฬา",
      "roman": "lɔɔ cù-laa",
      "tts": "ลอ จุฬา"
    },
    "sound": {
      "init": "l",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฬะ": "la",
      "ฬา": "laa",
      "ฬิ": "li",
      "ฬี": "lii",
      "ฬึ": "lue",
      "ฬื": "luue",
      "ฬุ": "lu",
      "ฬู": "luu",
      "เฬะ": "le",
      "เฬ": "lee",
      "แฬะ": "lae",
      "แฬ": "laae",
      "โฬะ": "lo",
      "โฬ": "loo"
    },
    "spell": {
      "ฬอ อะ": "ฬะ",
      "ฬอ อา": "ฬา",
      "ฬอ อิ": "ฬิ",
      "ฬอ อี": "ฬี",
      "ฬอ อึ": "ฬึ",
      "ฬอ อื": "ฬื",
      "ฬอ อุ": "ฬุ",
      "ฬอ อู": "ฬู",
      "ฬอ เอะ": "เฬะ",
      "ฬอ เอ": "เฬ",
      "ฬอ แอะ": "แฬะ",
      "ฬอ แอ": "แฬ",
      "ฬอ โอะ": "โฬะ",
      "ฬอ โอ": "โฬ",
      "ฬอ เออะ": "เฬอะ",
      "ฬอ เออ": "เฬอ"
    },
    "vocab": {
      "word": "จุฬา",
      "roman": "cù-laa",
      "mean": "凧(タコ)"
    },
    "tip": "ผの尻尾が結ばれる"
  },
  {
    "id": 43,
    "char": "อ",
    "type": "Consonant",
    "class": "Middle",
    "name": {
      "thai": "อ อ่าง",
      "roman": "ɔɔ àaŋ",
      "tts": "ออ อ่าง"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "อะ": "a",
      "อา": "aa",
      "อิ": "i",
      "อี": "ii",
      "อึ": "ue",
      "อื": "uue",
      "อุ": "u",
      "อู": "uu",
      "เอะ": "e",
      "เอ": "ee",
      "แอะ": "ae",
      "แอ": "aae",
      "โอะ": "o",
      "โอ": "oo",
      "เออะ": "oe",
      "เออ": "ooe"
    },
    "spell": {
      "อะ": "อะ",
      "อา": "อา",
      "อิ": "อิ",
      "อี": "อี",
      "อึ": "อึ",
      "อื": "อื",
      "อุ": "อุ",
      "อู": "อู",
      "เอะ": "เอะ",
      "เอ": "เอ",
      "แอะ": "แอะ",
      "แอ": "แอ",
      "โอะ": "โอะ",
      "โอ": "โอ",
      "เออะ": "เออะ",
      "เออ": "เออ"
    },
    "vocab": {
      "word": "อ่าง",
      "roman": "àaŋ",
      "mean": "洗面器/桶"
    },
    "tip": "ゼロのような形"
  },
  {
    "id": 44,
    "char": "ฮ",
    "type": "Consonant",
    "class": "Low",
    "name": {
      "thai": "ฮ นกฮูก",
      "roman": "hɔɔ nók-hûuk",
      "tts": "ฮอ นกฮูก"
    },
    "sound": {
      "init": "h",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฮะ": "ha",
      "ฮา": "haa",
      "ฮิ": "hi",
      "ฮี": "hii",
      "ฮึ": "hue",
      "ฮื": "huue",
      "ฮุ": "hu",
      "ฮู": "huu",
      "เฮะ": "he",
      "เฮ": "hee",
      "แฮะ": "hae",
      "แฮ": "haae",
      "โฮะ": "ho",
      "โฮ": "hoo",
      "เฮอะ": "hoe",
      "เฮอ": "hooe"
    },
    "spell": {
      "ฮอ อะ": "ฮะ",
      "ฮอ อา": "ฮา",
      "ฮอ อิ": "ฮิ",
      "ฮอ อี": "ฮี",
      "ฮอ อึ": "ฮึ",
      "ฮอ อื": "ฮื",
      "ฮอ อุ": "ฮุ",
      "ฮอ อู": "ฮู",
      "ฮอ เอะ": "เฮะ",
      "ฮอ เอ": "เฮ",
      "ฮอ แอะ": "แฮะ",
      "ฮอ แอ": "แฮ",
      "ฮอ โอะ": "โฮะ",
      "ฮอ โอ": "โฮ",
      "ฮอ เออะ": "เฮอะ",
      "ฮอ เออ": "เฮอ"
    },
    "vocab": {
      "word": "นกฮูก",
      "roman": "nók-hûuk",
      "mean": "ふくろう"
    },
    "tip": "อの屋根に飾り"
  },
  {
    "id": 45,
    "char": "-ะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอะ",
      "roman": "sà-rà à",
      "tts": "สระอะ"
    },
    "sound": {
      "init": "à",
      "final": "-"
    },
    "rule": {
      "pos": "Right",
      "pair": "-า",
      "change": "Change to ◌ั◌"
    },
    "drill": {
      "กะ": "kà",
      "จะ": "cà",
      "ตะ": "tà",
      "บะ": "bà",
      "ปะ": "pà",
      "อะ": "à",
      "ขะ": "khà",
      "ฉะ": "chà",
      "ถะ": "thà",
      "สะ": "sà",
      "หะ": "hà",
      "คะ": "khá",
      "ชะ": "chá",
      "นะ": "ná",
      "มะ": "má",
      "ละ": "lá"
    },
    "spell": {
      "กอ อะ": "กะ",
      "จอ อะ": "จะ",
      "ตอ อะ": "ตะ",
      "บอ อะ": "บะ",
      "ปอ อะ": "ปะ",
      "ออ อะ": "อะ",
      "ขอ อะ": "ขะ",
      "ฉอ อะ": "ฉะ",
      "ถอ อะ": "ถะ",
      "สอ อะ": "สะ",
      "หอ อะ": "หะ",
      "คอ อะ": "คะ",
      "ชอ อะ": "ชะ",
      "นอ อะ": "นะ",
      "มอ อะ": "มะ",
      "ลอ อะ": "ละ"
    },
    "vocab": {
      "word": "กะทิ",
      "roman": "kà-thí",
      "mean": "ココナッツミルク"
    },
    "tip": "-"
  },
  {
    "id": 46,
    "char": "-า",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระอา",
      "roman": "sà-rà aa",
      "tts": "สระอา"
    },
    "sound": {
      "init": "aa",
      "final": "-"
    },
    "rule": {
      "pos": "Right",
      "pair": "-ะ",
      "change": "-"
    },
    "drill": {
      "กา": "kaa",
      "จา": "caa",
      "ตา": "taa",
      "บา": "baa",
      "ปา": "paa",
      "อา": "aa",
      "ขา": "khǎa",
      "ถา": "thǎa",
      "ผา": "phǎa",
      "สา": "sǎa",
      "หา": "hǎa",
      "คา": "khaa",
      "งา": "ŋaa",
      "ทา": "thaa",
      "มา": "maa",
      "ลา": "laa"
    },
    "spell": {
      "กอ อา": "กา",
      "จอ อา": "จา",
      "ตอ อา": "ตา",
      "บอ อา": "บา",
      "ปอ อา": "ปา",
      "ออ อา": "อา",
      "ขอ อา": "ขา",
      "ถอ อา": "ถา",
      "ผอ อา": "ผา",
      "สอ อา": "สา",
      "หอ อา": "หา",
      "คอ อา": "คา",
      "งอ อา": "งา",
      "ทอ อา": "ทา",
      "มอ อา": "มา",
      "ลอ อา": "ลา"
    },
    "vocab": {
      "word": "ยา",
      "roman": "yaa",
      "mean": "薬"
    },
    "tip": "杖の形"
  },
  {
    "id": 47,
    "char": "-ิ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอิ",
      "roman": "sà-rà ì",
      "tts": "สระอิ"
    },
    "sound": {
      "init": "ì",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-ี",
      "change": "-"
    },
    "drill": {
      "กิ": "kì",
      "จิ": "cì",
      "ติ": "tì",
      "บิ": "bì",
      "ปิ": "pì",
      "อิ": "ì",
      "ขิ": "khì",
      "ถิ": "thì",
      "ผิ": "phì",
      "สิ": "sì",
      "หิ": "hì",
      "คิ": "khí",
      "ชิ": "chí",
      "นิ": "ní",
      "มิ": "mí",
      "ลิ": "lí"
    },
    "spell": {
      "กอ อิ": "กิ",
      "จอ อิ": "จิ",
      "ตอ อิ": "ติ",
      "บอ อิ": "บิ",
      "ปอ อิ": "ปิ",
      "ออ อิ": "อิ",
      "ขอ อิ": "ขิ",
      "ถอ อิ": "ถิ",
      "ผอ อิ": "ผิ",
      "สอ อิ": "สิ",
      "หอ อิ": "หิ",
      "คอ อิ": "คิ",
      "ชอ อิ": "ชิ",
      "นอ อิ": "นิ",
      "มอ อิ": "มิ",
      "ลอ อิ": "ลิ"
    },
    "vocab": {
      "word": "กะทิ",
      "roman": "kà-thí",
      "mean": "ココナッツミルク"
    },
    "tip": "山なりの線"
  },
  {
    "id": 48,
    "char": "-ี",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระอี",
      "roman": "sà-rà ii",
      "tts": "สระอี"
    },
    "sound": {
      "init": "ii",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-ิ",
      "change": "-"
    },
    "drill": {
      "กี": "kii",
      "จี": "cii",
      "ตี": "tii",
      "บี": "bii",
      "ปี": "pii",
      "อี": "ii",
      "ขี": "khǐi",
      "ถี": "thǐi",
      "ผี": "phǐi",
      "สี": "sǐi",
      "หี": "hǐi",
      "คี": "khii",
      "ชี": "chii",
      "นี": "nii",
      "มี": "mii",
      "ลี": "lii"
    },
    "spell": {
      "กอ อี": "กี",
      "จอ อี": "จี",
      "ตอ อี": "ตี",
      "บอ อี": "บี",
      "ปอ อี": "ปี",
      "ออ อี": "อี",
      "ขอ อี": "ขี",
      "ถอ อี": "ถี",
      "ผอ อี": "ผี",
      "สอ อี": "สี",
      "หอ อี": "หี",
      "คอ อี": "คี",
      "ชอ อี": "ชี",
      "นอ อี": "นี",
      "มอ อี": "มี",
      "ลอ อี": "ลี"
    },
    "vocab": {
      "word": "สี",
      "roman": "sǐi",
      "mean": "色"
    },
    "tip": "-ิ に縦線1本"
  },
  {
    "id": 49,
    "char": "-ึ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอึ",
      "roman": "sà-rà ɯ̀",
      "tts": "สระอึ"
    },
    "sound": {
      "init": "ɯ̀",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-ือ",
      "change": "-"
    },
    "drill": {
      "กึ": "kɯ̀",
      "จึ": "cɯ̀",
      "ตึ": "tɯ̀",
      "บึ": "bɯ̀",
      "ปึ": "pɯ̀",
      "อึ": "ɯ̀",
      "ขึ": "khɯ̀",
      "ถึ": "thɯ̀",
      "สึ": "sɯ̀",
      "หึ": "hɯ̀",
      "คึ": "khɯ́",
      "ชึ": "chɯ́",
      "นึ": "nɯ́",
      "มึ": "mɯ́",
      "ลึ": "lɯ́"
    },
    "spell": {
      "กอ อึ": "กึ",
      "จอ อึ": "จึ",
      "ตอ อึ": "ตึ",
      "บอ อึ": "บึ",
      "ปอ อึ": "ปึ",
      "ออ อึ": "อึ",
      "ขอ อึ": "ขึ",
      "ถอ อึ": "ถึ",
      "สอ อึ": "สึ",
      "หอ อึ": "หึ",
      "คอ อึ": "คึ",
      "ชอ อึ": "ชึ",
      "นอ อึ": "นึ",
      "มอ อึ": "มึ",
      "ลอ อึ": "ลึ"
    },
    "vocab": {
      "word": "อึกทึก",
      "roman": "ɯ̀k-thɯ́k",
      "mean": "騒々しい"
    },
    "tip": "-ิ に丸"
  },
  {
    "id": 50,
    "char": "-ือ",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระอือ",
      "roman": "sà-rà ɯɯ",
      "tts": "สระอือ"
    },
    "sound": {
      "init": "ɯɯ",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-ึ",
      "change": "Add อ if no final"
    },
    "drill": {
      "กือ": "kɯɯ",
      "จือ": "cɯɯ",
      "ตือ": "tɯɯ",
      "บือ": "bɯɯ",
      "ปือ": "pɯɯ",
      "อือ": "ɯɯ",
      "ขือ": "khɯ̌ɯ",
      "ถือ": "thɯ̌ɯ",
      "สือ": "sɯ̌ɯ",
      "หือ": "hɯ̌ɯ",
      "คือ": "khɯɯ",
      "ชือ": "chɯɯ",
      "มือ": "mɯɯ",
      "ลือ": "lɯɯ"
    },
    "spell": {
      "กอ อือ": "กือ",
      "จอ อือ": "จือ",
      "ตอ อือ": "ตือ",
      "บอ อือ": "บือ",
      "ปอ อือ": "ปือ",
      "ออ อือ": "อือ",
      "ขอ อือ": "ขือ",
      "ถอ อือ": "ถือ",
      "สอ อือ": "สือ",
      "หอ อือ": "หือ",
      "คอ อือ": "คือ",
      "ชอ อือ": "ชือ",
      "มอ อือ": "มือ",
      "ลอ อือ": "ลือ"
    },
    "vocab": {
      "word": "มือ",
      "roman": "mɯɯ",
      "mean": "手"
    },
    "tip": "-ิ に縦線2本"
  },
  {
    "id": 51,
    "char": "-ุ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอุ",
      "roman": "sà-rà ù",
      "tts": "สระอุ"
    },
    "sound": {
      "init": "ù",
      "final": "-"
    },
    "rule": {
      "pos": "Bottom",
      "pair": "-ู",
      "change": "-"
    },
    "drill": {
      "กุ": "kù",
      "จุ": "cù",
      "ตุ": "tù",
      "บุ": "bù",
      "ปุ": "pù",
      "อุ": "ù",
      "ขุ": "khù",
      "ถุ": "thù",
      "ผุ": "phù",
      "สุ": "sù",
      "หุ": "hù",
      "คุ": "khú",
      "ชุ": "chú",
      "นุ": "nú",
      "มุ": "mú",
      "ลุ": "lú"
    },
    "spell": {
      "กอ อุ": "กุ",
      "จอ อุ": "จุ",
      "ตอ อุ": "ตุ",
      "บอ อุ": "บุ",
      "ปอ อุ": "ปุ",
      "ออ อุ": "อุ",
      "ขอ อุ": "ขุ",
      "ถอ อุ": "ถุ",
      "ผอ อุ": "ผุ",
      "สอ อุ": "สุ",
      "หอ อุ": "หุ",
      "คอ อุ": "คุ",
      "ชอ อุ": "ชุ",
      "นอ อุ": "นุ",
      "มอ อุ": "มุ",
      "ลอ อุ": "ลุ"
    },
    "vocab": {
      "word": "ยุง",
      "roman": "yuŋ",
      "mean": "蚊"
    },
    "tip": "９のような形"
  },
  {
    "id": 52,
    "char": "-ู",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระอู",
      "roman": "sà-rà uu",
      "tts": "สระอู"
    },
    "sound": {
      "init": "uu",
      "final": "-"
    },
    "rule": {
      "pos": "Bottom",
      "pair": "-ุ",
      "change": "-"
    },
    "drill": {
      "กู": "kuu",
      "จู": "cuu",
      "ตู": "tuu",
      "บู": "buu",
      "ปู": "puu",
      "อู": "uu",
      "ขู": "khǔu",
      "ถู": "thǔu",
      "ผู": "phǔu",
      "สู": "sǔu",
      "หู": "hǔu",
      "คู": "khuu",
      "ชู": "chuu",
      "นู": "nuu",
      "มู": "muu",
      "รู": "ruu"
    },
    "spell": {
      "กอ อู": "กู",
      "จอ อู": "จู",
      "ตอ อู": "ตู",
      "บอ อู": "บู",
      "ปอ อู": "ปู",
      "ออ อู": "อู",
      "ขอ อู": "ขู",
      "ถอ อู": "ถู",
      "ผอ อู": "ผู",
      "สอ อู": "สู",
      "หอ อู": "หู",
      "คอ อู": "คู",
      "ชอ อู": "ชู",
      "นอ อู": "นู",
      "มอ อู": "มู",
      "รอ อู": "รู"
    },
    "vocab": {
      "word": "งู",
      "roman": "ŋuu",
      "mean": "蛇"
    },
    "tip": "ขのような形"
  },
  {
    "id": 53,
    "char": "เ-ะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเอะ",
      "roman": "sà-rà è",
      "tts": "สระเอะ"
    },
    "sound": {
      "init": "è",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-",
      "change": "Change to เ-็◌"
    },
    "drill": {
      "เกะ": "kè",
      "เจะ": "cè",
      "เตะ": "tè",
      "เบะ": "bè",
      "เปะ": "pè",
      "เอะ": "è",
      "เขะ": "khè",
      "เถะ": "thè",
      "เสะ": "sè",
      "เหะ": "hè",
      "เคะ": "khé",
      "เชะ": "ché",
      "เมะ": "mé",
      "เละ": "lé"
    },
    "spell": {
      "กอ เอะ": "เกะ",
      "จอ เอะ": "เจะ",
      "ตอ เอะ": "เตะ",
      "บอ เอะ": "เบะ",
      "ปอ เอะ": "เปะ",
      "ออ เอะ": "เอะ",
      "ขอ เอะ": "เขะ",
      "ถอ เอะ": "เถะ",
      "สอ เอะ": "เสะ",
      "หอ เอะ": "เหะ",
      "คอ เอะ": "เคะ",
      "ชอ เอะ": "เชะ",
      "มอ เอะ": "เมะ",
      "ลอ เอะ": "เละ"
    },
    "vocab": {
      "word": "เกะกะ",
      "roman": "kè-kà",
      "mean": "邪魔な"
    },
    "tip": "-"
  },
  {
    "id": 54,
    "char": "เ-",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระเอ",
      "roman": "sà-rà ee",
      "tts": "สระเอ"
    },
    "sound": {
      "init": "ee",
      "final": "-"
    },
    "rule": {
      "pos": "Left",
      "pair": "เ-ะ",
      "change": "-"
    },
    "drill": {
      "เก": "kee",
      "เจ": "cee",
      "เต": "tee",
      "เบ": "bee",
      "เป": "pee",
      "เอ": "ee",
      "เข": "khěe",
      "เถ": "thěe",
      "เผ": "phěe",
      "เส": "sěe",
      "เห": "hěe",
      "เค": "khee",
      "เช": "chee",
      "เน": "nee",
      "เม": "mee",
      "เล": "lee"
    },
    "spell": {
      "กอ เอ": "เก",
      "จอ เอ": "เจ",
      "ตอ เอ": "เต",
      "บอ เอ": "เบ",
      "ปอ เอ": "เป",
      "ออ เอ": "เอ",
      "ขอ เอ": "เข",
      "ถอ เอ": "เถ",
      "ผอ เอ": "เผ",
      "สอ เอ": "เส",
      "หอ เอ": "เห",
      "คอ เอ": "เค",
      "ชอ เอ": "เช",
      "นอ เอ": "เน",
      "มอ เอ": "เม",
      "ลอ เอ": "เล"
    },
    "vocab": {
      "word": "เท",
      "roman": "thee",
      "mean": "注ぐ/捨てる"
    },
    "tip": "棒が1本"
  },
  {
    "id": 55,
    "char": "แ-ะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระแอะ",
      "roman": "sà-rà ɛ̀",
      "tts": "สระแอะ"
    },
    "sound": {
      "init": "ɛ̀",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "แ-",
      "change": "Change to แ-็◌"
    },
    "drill": {
      "แกะ": "kɛ̀",
      "แจะ": "cɛ̀",
      "แตะ": "tɛ̀",
      "แปะ": "pɛ̀",
      "แอะ": "ɛ̀",
      "แขะ": "khɛ̀",
      "แฉะ": "chɛ̀",
      "แสะ": "sɛ̀",
      "แหะ": "hɛ̀",
      "แคะ": "khɛ́",
      "แนะ": "nɛ́",
      "แมะ": "mɛ́",
      "และ": "lɛ́"
    },
    "spell": {
      "กอ แอะ": "แกะ",
      "จอ แอะ": "แจะ",
      "ตอ แอะ": "แตะ",
      "ปอ แอะ": "แปะ",
      "ออ แอะ": "แอะ",
      "ขอ แอะ": "แขะ",
      "ฉอ แอะ": "แฉะ",
      "สอ แอะ": "แสะ",
      "หอ แอะ": "แหะ",
      "คอ แอะ": "แคะ",
      "นอ แอะ": "แนะ",
      "มอ แอะ": "แมะ",
      "ลอ แอะ": "และ"
    },
    "vocab": {
      "word": "แกะ",
      "roman": "kɛ̀",
      "mean": "羊/剥く"
    },
    "tip": "-"
  },
  {
    "id": 56,
    "char": "แ-",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระแอ",
      "roman": "sà-rà ɛɛ",
      "tts": "สระแอ"
    },
    "sound": {
      "init": "ɛɛ",
      "final": "-"
    },
    "rule": {
      "pos": "Left",
      "pair": "แ-ะ",
      "change": "-"
    },
    "drill": {
      "แก": "kɛɛ",
      "แจ": "cɛɛ",
      "แต": "tɛɛ",
      "แบ": "bɛɛ",
      "แป": "pɛɛ",
      "แอ": "ɛɛ",
      "แข": "khɛ̌ɛ",
      "แถ": "thɛ̌ɛ",
      "แผ": "phɛ̌ɛ",
      "แส": "sɛ̌ɛ",
      "แห": "hɛ̌ɛ",
      "แค": "khɛɛ",
      "แง": "ŋɛɛ",
      "แม": "mɛɛ",
      "แล": "lɛɛ"
    },
    "spell": {
      "กอ แอ": "แก",
      "จอ แอ": "แจ",
      "ตอ แอ": "แต",
      "บอ แอ": "แบ",
      "ปอ แอ": "แป",
      "ออ แอ": "แอ",
      "ขอ แอ": "แข",
      "ถอ แอ": "แถ",
      "ผอ แอ": "แผ",
      "สอ แอ": "แส",
      "หอ แอ": "แห",
      "คอ แอ": "แค",
      "งอ แอ": "แง",
      "มอ แอ": "แม",
      "ลอ แอ": "แล"
    },
    "vocab": {
      "word": "แม่",
      "roman": "mɛ̂ɛ",
      "mean": "母"
    },
    "tip": "棒が2本"
  },
  {
    "id": 57,
    "char": "โ-ะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระโอข",
      "roman": "sà-rà ò",
      "tts": "สระโอข"
    },
    "sound": {
      "init": "ò",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "โ-",
      "change": "Disappear (ลดรูป)"
    },
    "drill": {
      "โกะ": "kò",
      "โจะ": "cò",
      "โตะ": "tò",
      "โปะ": "pò",
      "โอะ": "ò",
      "โขะ": "khò",
      "โถะ": "thò",
      "โสะ": "sò",
      "โหะ": "hò",
      "โคะ": "khó",
      "โนะ": "nó",
      "โมะ": "mó",
      "โละ": "ló"
    },
    "spell": {
      "กอ โอะ": "โกะ",
      "จอ โอะ": "โจะ",
      "ตอ โอะ": "โตะ",
      "ปอ โอะ": "โปะ",
      "ออ โอะ": "โอะ",
      "ขอ โอะ": "โขะ",
      "ถอ โอะ": "โถะ",
      "สอ โอะ": "โสะ",
      "หอ โอะ": "โหะ",
      "คอ โอะ": "โคะ",
      "นอ โอะ": "โนะ",
      "มอ โอะ": "โมะ",
      "ลอ โอะ": "โละ"
    },
    "vocab": {
      "word": "โต๊ะ",
      "roman": "tó",
      "mean": "テーブル"
    },
    "tip": "-"
  },
  {
    "id": 58,
    "char": "โ-",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระโอ",
      "roman": "sà-rà oo",
      "tts": "สระโอ"
    },
    "sound": {
      "init": "oo",
      "final": "-"
    },
    "rule": {
      "pos": "Left",
      "pair": "โ-ะ",
      "change": "-"
    },
    "drill": {
      "โก": "koo",
      "โจ": "coo",
      "โต": "too",
      "โบ": "boo",
      "โป": "poo",
      "โอ": "oo",
      "โข": "khǒo",
      "โถ": "thǒo",
      "โผ": "phǒo",
      "โส": "sǒo",
      "โห": "hǒo",
      "โค": "khoo",
      "โช": "choo",
      "โน": "noo",
      "โม": "moo",
      "โล": "loo"
    },
    "spell": {
      "กอ โอ": "โก",
      "จอ โอ": "โจ",
      "ตอ โอ": "โต",
      "บอ โอ": "โบ",
      "ปอ โอ": "โป",
      "ออ โอ": "โอ",
      "ขอ โอ": "โข",
      "ถอ โอ": "โถ",
      "ผอ โอ": "โผ",
      "สอ โอ": "โส",
      "หอ โอ": "โห",
      "คอ โอ": "โค",
      "ชอ โอ": "โช",
      "นอ โอ": "โน",
      "มอ โอ": "โม",
      "ลอ โอ": "โล"
    },
    "vocab": {
      "word": "โมโห",
      "roman": "moo-hǒo",
      "mean": "怒る"
    },
    "tip": "背の高いロ"
  },
  {
    "id": 59,
    "char": "เ-าะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเอาะ",
      "roman": "sà-rà ɔ̀",
      "tts": "สระเอาะ"
    },
    "sound": {
      "init": "ɔ̀",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "-อ",
      "change": "-"
    },
    "drill": {
      "เกาะ": "kɔ̀",
      "เจาะ": "cɔ̀",
      "เตาะ": "tɔ̀",
      "เบาะ": "bɔ̀",
      "เปาะ": "pɔ̀",
      "เอาะ": "ɔ̀",
      "เขาะ": "khɔ̀",
      "เฉาะ": "chɔ̀",
      "เสาะ": "sɔ̀",
      "เหาะ": "hɔ̀",
      "เคาะ": "khɔ́",
      "เงาะ": "ŋɔ́",
      "เพาะ": "phɔ́",
      "เลาะ": "lɔ́"
    },
    "spell": {
      "กอ เอาะ": "เกาะ",
      "จอ เอาะ": "เจาะ",
      "ตอ เอาะ": "เตาะ",
      "บอ เอาะ": "เบาะ",
      "ปอ เอาะ": "เปาะ",
      "ออ เอาะ": "เอาะ",
      "ขอ เอาะ": "เขาะ",
      "ฉอ เอาะ": "เฉาะ",
      "สอ เอาะ": "เสาะ",
      "หอ เอาะ": "เหาะ",
      "คอ เอาะ": "เคาะ",
      "งอ เอาะ": "เงาะ",
      "พอ เอาะ": "เพาะ",
      "ลอ เอาะ": "เลาะ"
    },
    "vocab": {
      "word": "เกาะ",
      "roman": "kɔ̀",
      "mean": "島/掴む"
    },
    "tip": "-"
  },
  {
    "id": 60,
    "char": "-อ",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระออ",
      "roman": "sà-rà ɔɔ",
      "tts": "สระออ"
    },
    "sound": {
      "init": "ɔɔ",
      "final": "-"
    },
    "rule": {
      "pos": "Right",
      "pair": "เ-าะ",
      "change": "-"
    },
    "drill": {
      "กอ": "kɔɔ",
      "จอ": "cɔɔ",
      "ตอ": "tɔɔ",
      "บอ": "bɔɔ",
      "ปอ": "pɔɔ",
      "ออ": "ɔɔ",
      "ขอ": "khɔ̌ɔ",
      "ถอ": "thɔ̌ɔ",
      "สอ": "sɔ̌ɔ",
      "หอ": "hɔ̌ɔ",
      "คอ": "khɔɔ",
      "งอ": "ŋɔɔ",
      "รอ": "rɔɔ",
      "มอ": "mɔɔ"
    },
    "spell": {
      "กอ ออ": "กอ",
      "จอ ออ": "จอ",
      "ตอ ออ": "ตอ",
      "บอ ออ": "บอ",
      "ปอ ออ": "ปอ",
      "ออ ออ": "ออ",
      "ขอ ออ": "ขอ",
      "ถอ ออ": "ถอ",
      "สอ ออ": "สอ",
      "หอ ออ": "หอ",
      "คอ ออ": "คอ",
      "งอ ออ": "งอ",
      "รอ ออ": "รอ",
      "มอ ออ": "มอ"
    },
    "vocab": {
      "word": "รอ",
      "roman": "rɔɔ",
      "mean": "待つ"
    },
    "tip": "อと同じ形"
  },
  {
    "id": 61,
    "char": "เ-อะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเออะ",
      "roman": "sà-rà ə̀",
      "tts": "สระเออะ"
    },
    "sound": {
      "init": "ə̀",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-อ",
      "change": "-"
    },
    "drill": {
      "เกอะ": "kə̀",
      "เจอะ": "cə̀",
      "เตอะ": "tə̀",
      "เบอะ": "bə̀",
      "เปอะ": "pə̀",
      "เออะ": "ə̀",
      "เขอะ": "khə̀",
      "เถอะ": "thə̀",
      "เสอะ": "sə̀",
      "เหอะ": "hə̀",
      "เคอะ": "khə́",
      "เชอะ": "chə́",
      "เยอะ": "yə́",
      "เลอะ": "lə́"
    },
    "spell": {
      "กอ เออะ": "เกอะ",
      "จอ เออะ": "เจอะ",
      "ตอ เออะ": "เตอะ",
      "บอ เออะ": "เบอะ",
      "ปอ เออะ": "เปอะ",
      "ออ เออะ": "เออะ",
      "ขอ เออะ": "เขอะ",
      "ถอ เออะ": "เถอะ",
      "สอ เออะ": "เสอะ",
      "หอ เออะ": "เหอะ",
      "คอ เออะ": "เคอะ",
      "ชอ เออะ": "เชอะ",
      "ยอ เออะ": "เยอะ",
      "ลอ เออะ": "เลอะ"
    },
    "vocab": {
      "word": "เยอะ",
      "roman": "yə́",
      "mean": "沢山"
    },
    "tip": "-"
  },
  {
    "id": 62,
    "char": "เ-อ",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระเออ",
      "roman": "sà-rà əə",
      "tts": "สระเออ"
    },
    "sound": {
      "init": "əə",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-อะ",
      "change": "Change to เ-ิ◌"
    },
    "drill": {
      "เกอ": "kəə",
      "เจอ": "cəə",
      "เตอ": "təə",
      "เบอ": "bəə",
      "เปอ": "pəə",
      "เออ": "əə",
      "เขอ": "khə̌ə",
      "เถอ": "thə̌ə",
      "เสอ": "sə̌ə",
      "เหอ": "hə̌ə",
      "เคอ": "khəə",
      "เชอ": "chəə",
      "เมอ": "məə",
      "เลอ": "ləə"
    },
    "spell": {
      "กอ เออ": "เกอ",
      "จอ เออ": "เจอ",
      "ตอ เออ": "เตอ",
      "บอ เออ": "เบอ",
      "ปอ เออ": "เปอ",
      "ออ เออ": "เออ",
      "ขอ เออ": "เขอ",
      "ถอ เออ": "เถอ",
      "สอ เออ": "เสอ",
      "หอ เออ": "เหอ",
      "คอ เออ": "เคอ",
      "ชอ เออ": "เชอ",
      "มอ เออ": "เมอ",
      "ลอ เออ": "เลอ"
    },
    "vocab": {
      "word": "เจอ",
      "roman": "cəə",
      "mean": "会う"
    },
    "tip": "-"
  },
  {
    "id": 63,
    "char": "เ-ียะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเอียะ",
      "roman": "sà-rà ìa",
      "tts": "สระเอียะ"
    },
    "sound": {
      "init": "ìa",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-ีย",
      "change": "-"
    },
    "drill": {
      "เกียะ": "kìa",
      "เจียะ": "cìa",
      "เตียะ": "tìa",
      "เปียะ": "pìa",
      "เอียะ": "ìa",
      "เขียะ": "khìa",
      "เสียะ": "sìa",
      "เหียะ": "hìa",
      "เคียะ": "khía",
      "เชียะ": "chía",
      "เมียะ": "mía",
      "เลียะ": "lía"
    },
    "spell": {
      "กอ เอียะ": "เกียะ",
      "จอ เอียะ": "เจียะ",
      "ตอ เอียะ": "เตียะ",
      "ปอ เอียะ": "เปียะ",
      "ยอ เอียะ": "เลียะ",
      "ขอ เอียะ": "เขียะ",
      "คอ เอียะ": "เคียะ",
      "ชอ เอียะ": "เชียะ",
      "มอ เอียะ": "เมียะ"
    },
    "vocab": {
      "word": "เปรี๊ยะ",
      "roman": "pría",
      "mean": "パチッ(音)"
    },
    "tip": "-"
  },
  {
    "id": 64,
    "char": "เ-ีย",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระเอีย",
      "roman": "sà-rà iia",
      "tts": "สระเอีย"
    },
    "sound": {
      "init": "iia",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-ียะ",
      "change": "-"
    },
    "drill": {
      "เกีย": "kiia",
      "เจีย": "ciia",
      "เตีย": "tiia",
      "เบีย": "biia",
      "เปีย": "piia",
      "เอีย": "iia",
      "เขีย": "khǐia",
      "เสีย": "sǐia",
      "เหีย": "hǐia",
      "เคีย": "khiia",
      "เชีย": "chiia",
      "เมีย": "miia",
      "เลย": "liia"
    },
    "spell": {
      "กอ เอีย": "เกีย",
      "จอ เอีย": "เจีย",
      "ตอ เอีย": "เตีย",
      "บอ เอีย": "เบีย",
      "ปอ เอีย": "เปีย",
      "ยอ เอีย": "เลย",
      "ขอ เอีย": "เขีย",
      "คอ เอีย": "เคีย",
      "ชอ เอีย": "เชีย",
      "มอ เอีย": "เมีย"
    },
    "vocab": {
      "word": "เมีย",
      "roman": "miia",
      "mean": "妻"
    },
    "tip": "-"
  },
  {
    "id": 65,
    "char": "เ-ือะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเอือะ",
      "roman": "sà-rà ɯ̀a",
      "tts": "สระเอือะ"
    },
    "sound": {
      "init": "ɯ̀a",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-ือ",
      "change": "-"
    },
    "drill": {
      "เกือะ": "kɯ̀a",
      "เจือะ": "cɯ̀a",
      "เตือะ": "tɯ̀a",
      "เบือะ": "bɯ̀a",
      "เปือะ": "pɯ̀a",
      "เขือะ": "khɯ̀a",
      "เสือะ": "sɯ̀a",
      "เหือะ": "hɯ̀a",
      "เครือะ": "khrɯ́a",
      "เชือะ": "chɯ́a",
      "เมือะ": "mɯ́a"
    },
    "spell": {
      "กอ เอือะ": "เกือะ",
      "จอ เอือะ": "เจือะ",
      "ตอ เอือะ": "เตือะ",
      "บอ เอือะ": "เบือะ",
      "ปอ เอือะ": "เปือะ",
      "ขอ เอือะ": "เขือะ",
      "สอ เอือะ": "เสือะ",
      "หอ เอือะ": "เหือะ",
      "คอ เอือะ": "เครือะ",
      "ชอ เอือะ": "เชือะ",
      "มอ เอือะ": "เมือะ"
    },
    "vocab": {
      "word": "-",
      "roman": "-",
      "mean": "(ほぼなし)"
    },
    "tip": "-"
  },
  {
    "id": 66,
    "char": "เ-ือ",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระเอือ",
      "roman": "sà-rà ɯɯa",
      "tts": "สระเอือ"
    },
    "sound": {
      "init": "ɯɯa",
      "final": "-"
    },
    "rule": {
      "pos": "Surround",
      "pair": "เ-ือะ",
      "change": "-"
    },
    "drill": {
      "เกือ": "kɯɯa",
      "เจือ": "cɯɯa",
      "เตือ": "tɯɯa",
      "เบือ": "bɯɯa",
      "เปือ": "pɯɯa",
      "เอือ": "ɯɯa",
      "เขือ": "khɯ̌ɯa",
      "เสือ": "sɯ̌ɯa",
      "เหนือ": "nɯ̌ɯa",
      "เครือ": "khrɯɯa",
      "เชือ": "chɯɯa",
      "เมือ": "mɯɯa",
      "เรือ": "rɯa"
    },
    "spell": {
      "กอ เอือ": "เกือ",
      "จอ เอือ": "เจือ",
      "ตอ เอือ": "เตือ",
      "บอ เอือ": "เบือ",
      "ปอ เอือ": "เปือ",
      "ออ เอือ": "เอือ",
      "ขอ เอือ": "เขือ",
      "สอ เอือ": "เสือ",
      "นอ เอือ": "เหนือ",
      "คอ เอือ": "เครือ",
      "ชอ เอือ": "เชือ",
      "มอ เอือ": "เมือ",
      "รอ เอือ": "เรือ"
    },
    "vocab": {
      "word": "เรือ",
      "roman": "rɯa",
      "mean": "船"
    },
    "tip": "-"
  },
  {
    "id": 67,
    "char": "-ัวะ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอัวะ",
      "roman": "sà-rà ù a",
      "tts": "สระอัวะ"
    },
    "sound": {
      "init": "ù a",
      "final": "-"
    },
    "rule": {
      "pos": "Right+Top",
      "pair": "-ัว",
      "change": "-"
    },
    "drill": {
      "กัวะ": "kùa",
      "จัวะ": "cùa",
      "ตัวะ": "tùa",
      "บัวะ": "bùa",
      "ปัวะ": "pùa",
      "ขัวะ": "khùa",
      "สัวะ": "sùa",
      "หัวะ": "hùa",
      "คัวะ": "khúa",
      "ชัวะ": "chúa",
      "มัวะ": "múa",
      "รัวะ": "rúa"
    },
    "spell": {
      "กอ อัวะ": "กัวะ",
      "จอ อัวะ": "จัวะ",
      "ตอ อัวะ": "ตัวะ",
      "บอ อัวะ": "บัวะ",
      "ปอ อัวะ": "ปัวะ",
      "ขอ อัวะ": "ขัวะ",
      "วอ อัวะ": "หัวะ",
      "คอ อัวะ": "คัวะ",
      "ชอ อัวะ": "ชัวะ",
      "มอ อัวะ": "มัวะ",
      "รอ อัวะ": "รัวะ"
    },
    "vocab": {
      "word": "ผัวะ",
      "roman": "phùa",
      "mean": "バシッ(音)"
    },
    "tip": "-"
  },
  {
    "id": 68,
    "char": "-ัว",
    "type": "Vowel",
    "class": "Long",
    "name": {
      "thai": "สระอัว",
      "roman": "sà-rà uua",
      "tts": "สระอัว"
    },
    "sound": {
      "init": "uua",
      "final": "-"
    },
    "rule": {
      "pos": "Right+Top",
      "pair": "-ัวะ",
      "change": "Change to -ว-"
    },
    "drill": {
      "กัว": "kuua",
      "จัว": "cuua",
      "ตัว": "tuua",
      "บัว": "buua",
      "ปัว": "puua",
      "อัว": "uua",
      "ขัว": "khǔua",
      "ถัว": "thǔua",
      "สัว": "sǔua",
      "หัว": "hǔua",
      "ครัว": "khruua",
      "ชัว": "chuua",
      "มัว": "muua",
      "วัว": "wuua"
    },
    "spell": {
      "กอ อัว": "กัว",
      "จอ อัว": "จัว",
      "ตอ อัว": "ตัว",
      "บอ อัว": "บัว",
      "ปอ อัว": "ปัว",
      "วอ อัว": "วัว",
      "ขอ อัว": "ขัว",
      "ถอ อัว": "ถัว",
      "คอ อัว": "ครัว",
      "ชอ อัว": "ชัว",
      "มอ อัว": "มัว"
    },
    "vocab": {
      "word": "วัว",
      "roman": "wua",
      "mean": "牛"
    },
    "tip": "-"
  },
  {
    "id": 69,
    "char": "ำ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระอำ",
      "roman": "sà-rà am",
      "tts": "สระอำ"
    },
    "sound": {
      "init": "am",
      "final": "m"
    },
    "rule": {
      "pos": "Right+Top",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "กำ": "kam",
      "จำ": "cam",
      "ตำ": "tam",
      "บำ": "bam",
      "ปำ": "pam",
      "อำ": "am",
      "ขำ": "khǎm",
      "ถำ": "thǎm",
      "สำ": "sǎm",
      "หำ": "hǎm",
      "คำ": "kham",
      "ทำ": "tham",
      "นำ": "nam",
      "ลำ": "lam"
    },
    "spell": {
      "กอ อำ": "กำ",
      "จอ อำ": "จำ",
      "ตอ อำ": "ตำ",
      "บอ อำ": "บำ",
      "ปอ อำ": "ปำ",
      "ออ อำ": "อำ",
      "ขอ อำ": "ขำ",
      "ถอ อำ": "ถำ",
      "สอ อำ": "สำ",
      "หอ อำ": "หำ",
      "คอ อำ": "คำ",
      "ทอ อำ": "ทำ",
      "นอ อำ": "นำ",
      "ลอ อำ": "ลำ"
    },
    "vocab": {
      "word": "ทำ",
      "roman": "tham",
      "mean": "する/作る"
    },
    "tip": "-า に丸"
  },
  {
    "id": 70,
    "char": "ไ-",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระไอไม้มลาย",
      "roman": "sà-rà ay",
      "tts": "สระไอไม้มลาย"
    },
    "sound": {
      "init": "ay",
      "final": "y"
    },
    "rule": {
      "pos": "Left",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ไก": "kay",
      "ใจ": "cay",
      "ไต": "tay",
      "ใบ": "bay",
      "ไป": "pay",
      "ไอ": "ay",
      "ไข": "khǎy",
      "ไถ": "thǎy",
      "ไส": "sǎy",
      "ไห": "hǎy",
      "ไค": "khay",
      "ไท": "thay",
      "ไว": "way",
      "ไฟ": "fay"
    },
    "spell": {
      "กอ ไอ": "ไก",
      "จอ ไอ": "ใจ",
      "ตอ ไอ": "ไต",
      "บอ ไอ": "ใบ",
      "ปอ ไอ": "ไป",
      "ออ ไอ": "ไอ",
      "ขอ ไอ": "ไข",
      "ถอ ไอ": "ไถ",
      "สอ ไอ": "ไส",
      "หอ ไอ": "ไห",
      "คอ ไอ": "ไค",
      "ทอ ไอ": "ไท",
      "วอ ไอ": "ไว",
      "ฟอ ไอ": "ไฟ"
    },
    "vocab": {
      "word": "ไป",
      "roman": "pai",
      "mean": "行く"
    },
    "tip": "V字に折れる"
  },
  {
    "id": 71,
    "char": "ใ-",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระใอไม้ม้วน",
      "roman": "sà-rà ay",
      "tts": "สระใอไม้ม้วน"
    },
    "sound": {
      "init": "ay",
      "final": "y"
    },
    "rule": {
      "pos": "Left",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ใก": "kay",
      "ใจ": "cay",
      "ใด": "day",
      "ใบ": "bay",
      "ใส": "sǎy",
      "ให": "hǎy",
      "ใน": "nay",
      "ใฝ": "fǎy",
      "ใย": "yay",
      "ใคร": "khray",
      "ใกล้": "klâay",
      "ใหญ่": "yày",
      "ใหม่": "mày",
      "ใช้": "cháy",
      "ใต้": "tâay"
    },
    "spell": {
      "กอ ใอ": "ใก",
      "จอ ใอ": "ใจ",
      "ดอ ใอ": "ใด",
      "บอ ใอ": "ใบ",
      "สอ ใอ": "ใส",
      "หอ ใอ": "ให",
      "นอ ใอ": "ใน",
      "ฝอ ใอ": "ใฝ",
      "ยอ ใอ": "ใย",
      "คอ ใอ": "ใคร",
      "กอ ใอ ไม้โท": "ใกล้",
      "ยอ ใอ ไม้เอก": "ใหญ่",
      "มอ ใอ ไม้เอก": "ใหม่",
      "ชอ ใอ ไม้โท": "ใช้",
      "ตอ ใอ ไม้โท": "ใต้"
    },
    "vocab": {
      "word": "ใจ",
      "roman": "cai",
      "mean": "心"
    },
    "tip": "内側に巻く"
  },
  {
    "id": 72,
    "char": "เ-า",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "สระเอา",
      "roman": "sà-rà ao",
      "tts": "สระเอา"
    },
    "sound": {
      "init": "ao",
      "final": "w"
    },
    "rule": {
      "pos": "Surround",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "เกา": "kao",
      "เจา": "cao",
      "เตา": "tao",
      "เบา": "bao",
      "เปา": "pao",
      "เอา": "ao",
      "เขา": "khǎo",
      "เถา": "thǎo",
      "เสา": "sǎo",
      "เหา": "hǎo",
      "เคา": "khao",
      "เทา": "thao",
      "เรา": "rao",
      "เมา": "mao"
    },
    "spell": {
      "กอ เอา": "เกา",
      "จอ เอา": "เจา",
      "ตอ เอา": "เตา",
      "บอ เอา": "เบา",
      "ปอ เอา": "เปา",
      "ออ เอา": "เอา",
      "ขอ เอา": "เขา",
      "ถอ เอา": "เถา",
      "สอ เอา": "เสา",
      "หอ เอา": "เหา",
      "คอ เอา": "เคา",
      "ทอ เอา": "เทา",
      "รอ เอา": "เรา",
      "มอ เอา": "เมา"
    },
    "vocab": {
      "word": "เอา",
      "roman": "ao",
      "mean": "要る/取る"
    },
    "tip": "เ と -า"
  },
  {
    "id": 73,
    "char": "ฤ",
    "type": "Vowel",
    "class": "Short",
    "name": {
      "thai": "ตัว ฤ",
      "roman": "rué",
      "tts": "ตัว รึ"
    },
    "sound": {
      "init": "rué",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "-"
    },
    "drill": {
      "ฤ": "rɯ́",
      "ฤๅ": "rɯɯ",
      "ฤดู": "rɯ́-duu",
      "ฤทธิ์": "rít",
      "พฤกษา": "phrɯ́k-sǎa"
    },
    "spell": {},
    "vocab": {
      "word": "ฤดู",
      "roman": "rɯ́-duu",
      "mean": "季節"
    },
    "tip": "ถの足が長い"
  },
  {
    "id": 74,
    "char": "่",
    "type": "Tone",
    "class": "-",
    "name": {
      "thai": "ไม้เอก",
      "roman": "mái èek",
      "tts": "ไม้เอก"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Low+1=Falling"
    },
    "drill": {
      "ก่า": "kàa",
      "จ่า": "càa",
      "ด่า": "dàa",
      "ต่า": "tàa",
      "ป่า": "pàa",
      "อ่า": "àa",
      "ข่า": "khàa",
      "ถ่าย": "thàay",
      "ผ่า": "phàa",
      "ส่า": "sàa",
      "ห่า": "hàa",
      "ค่า": "khâa",
      "ง่าย": "ŋâay",
      "ท่าย": "thâay",
      "แม่": "mɛ̂ɛ",
      "ไล่": "lây"
    },
    "spell": {},
    "vocab": {
      "word": "ไก่",
      "roman": "kài",
      "mean": "鶏"
    },
    "tip": "縦棒"
  },
  {
    "id": 75,
    "char": "้",
    "type": "Tone",
    "class": "-",
    "name": {
      "thai": "ไม้โท",
      "roman": "mái thoo",
      "tts": "ไม้โท"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Low+2=High"
    },
    "drill": {
      "ก้า": "kâa",
      "จ้า": "câa",
      "ด้า": "dâa",
      "ต้า": "tâa",
      "ป้า": "pâa",
      "อ้า": "âa",
      "ข้า": "khâa",
      "ถ้า": "thâa",
      "ผ้า": "phâa",
      "ส้า": "sâa",
      "ห้า": "hâa",
      "ค้า": "kháa",
      "ช้า": "cháa",
      "น้า": "náa",
      "ม้า": "máa",
      "รู้": "rúu"
    },
    "spell": {},
    "vocab": {
      "word": "เก้า",
      "roman": "kâao",
      "mean": 9
    },
    "tip": "2のような形"
  },
  {
    "id": 76,
    "char": "๊",
    "type": "Tone",
    "class": "-",
    "name": {
      "thai": "ไม้ตรี",
      "roman": "mái trii",
      "tts": "ไม้ตรี"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Mid+3=High"
    },
    "drill": {
      "ก๊า": "káa",
      "จ๊า": "cáa",
      "ด๊า": "dáa",
      "ต๊า": "táa",
      "ป๊า": "páa",
      "อ๊า": "áa",
      "กุ๊ก": "kúk",
      "โต๊ะ": "tó",
      "เจี๊ยบ": "cíiap",
      "เปรี้ยะ": "pría"
    },
    "spell": {},
    "vocab": {
      "word": "โต๊ะ",
      "roman": "tó",
      "mean": "テーブル"
    },
    "tip": "7のような形"
  },
  {
    "id": 77,
    "char": "๋",
    "type": "Tone",
    "class": "-",
    "name": {
      "thai": "ไม้จัตวา",
      "roman": "mái càt-tà-waa",
      "tts": "ไม้จัตวา"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Mid+4=Rising"
    },
    "drill": {
      "ก๋า": "kǎa",
      "จ๋า": "cǎa",
      "ด๋า": "dǎa",
      "ต๋า": "tǎa",
      "ป๋า": "pǎa",
      "อ๋า": "ǎa",
      "เก๋": "kěe",
      "ตั๋ว": "tǔua",
      "เดี๋ยว": "dǐiao"
    },
    "spell": {},
    "vocab": {
      "word": "เก๋",
      "roman": "kěe",
      "mean": "粋な/シック"
    },
    "tip": "＋記号"
  },
  {
    "id": 78,
    "char": "์",
    "type": "Symbol",
    "class": "-",
    "name": {
      "thai": "ไม้ทัณฑฆาต",
      "roman": "mái than-thá-khâat",
      "tts": "ไม้ทัณฑฆาต"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Silence letter"
    },
    "drill": {
      "เสาร์": "sǎo",
      "อาทิตย์": "aa-thít",
      "จันทร์": "can",
      "ศุกร์": "sùk",
      "สัตว์": "sàt",
      "ยักษ์": "yák",
      "โทรศัพท์": "thoo-rá-sàp",
      "รถเมล์": "rót-mee",
      "คอมพิวเตอร์": "khɔm-phiw-tə̂ə",
      "ทัวร์": "thua"
    },
    "spell": {},
    "vocab": {
      "word": "เสาร์",
      "roman": "sǎo",
      "mean": "土曜(rは読まない)"
    },
    "tip": "-"
  },
  {
    "id": 79,
    "char": "ๆ",
    "type": "Symbol",
    "class": "-",
    "name": {
      "thai": "ไม้ยมก",
      "roman": "mái yà-mók",
      "tts": "ไม้ยมก"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Right",
      "pair": "-",
      "change": "Repeat word"
    },
    "drill": {
      "ต่างๆ": "tàaŋ-tàaŋ",
      "จริงๆ": "ciŋ-ciŋ",
      "ช้าๆ": "cháa-cháa",
      "ดีๆ": "dii-dii",
      "เร็วๆ": "reo-reo",
      "บ่อยๆ": "bɔ̀y-bɔ̀y",
      "มากๆ": "mâak-mâak",
      "สวยๆ": "sǔuay-sǔuay",
      "น้องๆ": "nɔ́ɔŋ-nɔ́ɔŋ",
      "เพื่อนๆ": "phɯ̂ɯan-phɯ̂ɯan"
    },
    "spell": {},
    "vocab": {
      "word": "บ่อยๆ",
      "roman": "bɔ̀y-bɔ̀y",
      "mean": "度々"
    },
    "tip": "-"
  },
  {
    "id": 80,
    "char": "รร",
    "type": "Exception",
    "class": "-",
    "name": {
      "thai": "ร หัน",
      "roman": "rɔɔ hǎn",
      "tts": "รอ หัน"
    },
    "sound": {
      "init": "-",
      "final": "n"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "Reads as \"an\""
    },
    "drill": {
      "กรร": "kan",
      "ขรร": "khan",
      "ครร": "khan",
      "จรร": "can",
      "ฉรร": "chan",
      "สรร": "sǎn",
      "หรร": "hǎn",
      "วรร": "wan",
      "บรร": "ban",
      "กรรไกร": "kan-kray",
      "ภรรยา": "phan-rá-yaa"
    },
    "spell": {},
    "vocab": {
      "word": "กรรไกร",
      "roman": "kan-krai",
      "mean": "ハサミ"
    },
    "tip": "rが2つ"
  },
  {
    "id": 81,
    "char": "รร(ม)",
    "type": "Exception",
    "class": "-",
    "name": {
      "thai": "ร หัน มีตัวสะกด",
      "roman": "rɔɔ hǎn",
      "tts": "รอ หัน มีตัวสะกด"
    },
    "sound": {
      "init": "-",
      "final": "a"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "Reads as \"a\""
    },
    "drill": {
      "กรรม": "kam",
      "ธรรม": "tham",
      "วรรค": "wák",
      "สรรพ": "sàp",
      "พรรค": "phák"
    },
    "spell": {},
    "vocab": {
      "word": "ธรรม",
      "roman": "tham",
      "mean": "法/ダルマ"
    },
    "tip": "rが2つ+末子音"
  },
  {
    "id": 82,
    "char": "ทร",
    "type": "Exception",
    "class": "-",
    "name": {
      "thai": "ทร ออกเสียง ซ",
      "roman": "thɔɔ rɔɔ pen sɔɔ",
      "tts": "ทรอ ออกเสียง ซอ"
    },
    "sound": {
      "init": "s",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "Sound Change"
    },
    "drill": {
      "ทร": "sɔɔ",
      "ทราบ": "sâap",
      "ทราย": "saay",
      "ทรง": "soŋ",
      "ทรัพย์": "sáp",
      "พุทรา": "phút-saa",
      "อินทรี": "in-sii",
      "นนทรี": "non-sii",
      "ทรวง": "suuaŋ",
      "ทรุด": "sút"
    },
    "spell": {},
    "vocab": {
      "word": "ทราบ",
      "roman": "sâap",
      "mean": "存じる/知る"
    },
    "tip": "ทรの並び"
  },
  {
    "id": 83,
    "char": "ควบไม่แท้",
    "type": "Exception",
    "class": "-",
    "name": {
      "thai": "อักษรควบไม่แท้",
      "roman": "silent r",
      "tts": "อักษรควบไม่แท้"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "-",
      "pair": "-",
      "change": "Silent \"r\""
    },
    "drill": {
      "จริง": "ciŋ",
      "สร้อย": "sɔ̂ɔy",
      "สร้าง": "sâaŋ",
      "เสร็จ": "sèt",
      "เศร้า": "sâo",
      "ไซร้": "sáy"
    },
    "spell": {},
    "vocab": {
      "word": "สร้าง",
      "roman": "sâaŋ",
      "mean": "建設する"
    },
    "tip": "จ,ส,ศ + ร"
  },
  {
    "id": 84,
    "char": "ห นำ",
    "type": "Exception",
    "class": "High Rule",
    "name": {
      "thai": "ห นำ",
      "roman": "hɔ̌ɔ nam",
      "tts": "หอ นำ"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Left",
      "pair": "-",
      "change": "Change Tone Rule"
    },
    "drill": {
      "หมา": "mǎa",
      "หนู": "nǔu",
      "หมู": "mǔu",
      "หมี": "mǐi",
      "ไหม": "mǎy",
      "ไหล": "lǎy",
      "ใหญ่": "yày",
      "หญิง": "yǐŋ",
      "แหวน": "wɛ̌ɛn",
      "หวาน": "wǎan",
      "หงอก": "ŋɔ̀ɔk",
      "หน่าย": "nàay",
      "หมอ": "mɔ̌ɔ",
      "หลาน": "lǎan"
    },
    "spell": {},
    "vocab": {
      "word": "หนู",
      "roman": "nǔu",
      "mean": "ねずみ(Rising)"
    },
    "tip": "ห + 低子音"
  },
  {
    "id": 85,
    "char": "อ นำ",
    "type": "Exception",
    "class": "Mid Rule",
    "name": {
      "thai": "อ นำ (4คำ)",
      "roman": "ɔɔ nam",
      "tts": "ออ นำ ยอ"
    },
    "sound": {
      "init": "-",
      "final": "-"
    },
    "rule": {
      "pos": "Left",
      "pair": "-",
      "change": "Change Tone Rule"
    },
    "drill": {
      "อย่า": "yàa",
      "อยู่": "yùu",
      "อย่าง": "yàaŋ",
      "อยาก": "yàak"
    },
    "spell": {},
    "vocab": {
      "word": "อยู่",
      "roman": "yùu",
      "mean": "居る(Low)"
    },
    "tip": "อ + ย"
  },
  {
    "id": 86,
    "char": "ก็",
    "type": "Exception",
    "class": "Falling",
    "name": {
      "thai": "ไม้ไต่คู้",
      "roman": "kɔ̂ɔ",
      "tts": "ไม้ไต่คู้"
    },
    "sound": {
      "init": "k",
      "final": "-"
    },
    "rule": {
      "pos": "Top",
      "pair": "-",
      "change": "Special Word"
    },
    "drill": {
      "ก็": "kɔ̂ɔ"
    },
    "spell": {},
    "vocab": {
      "word": "ก็",
      "roman": "kɔ̂ɔ",
      "mean": "〜も(Also)"
    },
    "tip": "ก + ◌็"
  }
];